<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  <meta http-equiv="X-UA-Compatible" content="chrome=1">
  
  <title>操作系统：进程与线程 | 山猪的小站</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
  
    <meta name="author" content="John Doe">
  
  
    <meta name="description" content="1. 进程概念

未配置OS的系统中，程序是顺序执行的；在多道程序环境下，允许多个程序并发执行。

1.1 程序顺序执行的特征

顺序性：处理机操作严格按照所规定的顺序执行。即：本操作结束之后才可以进行下一个操作。
封闭性：程序在封闭环境下执行。即：程序运行时独占全机资源，资源的状态只有本程序才能改变，程序一旦执行，其结果不受外界因素干扰
可再现性：只要程序执行时的环境和初始条件相同，当程序重复执">
  
  <meta name="description" content="1. 进程概念  未配置OS的系统中，程序是顺序执行的；在多道程序环境下，允许多个程序并发执行。  1.1 程序顺序执行的特征  顺序性：处理机操作严格按照所规定的顺序执行。即：本操作结束之后才可以进行下一个操作。 封闭性：程序在封闭环境下执行。即：程序运行时独占全机资源，资源的状态只有本程序才能改变，程序一旦执行，其结果不受外界因素干扰 可再现性：只要程序执行时的环境和初始条件相同，当程序重复执">
<meta property="og:type" content="article">
<meta property="og:title" content="操作系统：进程与线程">
<meta property="og:url" content="http://example.com/2021/04/09/%E6%93%8D%E4%BD%9C%E7%B3%BB%E7%BB%9F%EF%BC%9A%E8%BF%9B%E7%A8%8B%E4%B8%8E%E7%BA%BF%E7%A8%8B/index.html">
<meta property="og:site_name" content="山猪的小站">
<meta property="og:description" content="1. 进程概念  未配置OS的系统中，程序是顺序执行的；在多道程序环境下，允许多个程序并发执行。  1.1 程序顺序执行的特征  顺序性：处理机操作严格按照所规定的顺序执行。即：本操作结束之后才可以进行下一个操作。 封闭性：程序在封闭环境下执行。即：程序运行时独占全机资源，资源的状态只有本程序才能改变，程序一旦执行，其结果不受外界因素干扰 可再现性：只要程序执行时的环境和初始条件相同，当程序重复执">
<meta property="og:locale" content="en_US">
<meta property="og:image" content="https://supers1.oss-cn-hangzhou.aliyuncs.com/20210409140031.png">
<meta property="og:image" content="https://supers1.oss-cn-hangzhou.aliyuncs.com/20210409135947.png">
<meta property="article:published_time" content="2021-04-08T23:58:06.000Z">
<meta property="article:modified_time" content="2021-06-12T04:41:45.146Z">
<meta property="article:author" content="John Doe">
<meta name="twitter:card" content="summary">
<meta name="twitter:image" content="https://supers1.oss-cn-hangzhou.aliyuncs.com/20210409140031.png">
  
    <link rel="alternate" href="/atom.xml" title="山猪的小站" type="application/atom+xml">
  
  
    <link rel="icon" type="image/x-icon" href="/favicon.ico">
  
  
<link rel="stylesheet" href="/css/style.css">

  <!--[if lt IE 9]><script src="//html5shiv.googlecode.com/svn/trunk/html5.js"></script><![endif]-->
  
<meta name="generator" content="Hexo 5.4.0"></head>

<body>
  <div class="wrapper">
    <header id="header">
  <div class="title">
    <h1><a href="/">山猪的小站</a></h1>
    <p><a href="/">Become so tired so much aware!</a></p>
  </div>
  <nav class="nav">
    <ul>
      
        <li><a href="/">Home</a></li>
      
        <li><a href="/archives">Archives</a></li>
      
      
        <li><a href="/atom.xml">RSS</a></li>
      
    </ul>
    <div class="clearfix"></div>
  </nav>
  <div class="clearfix"></div>
</header>
    <div class="content"><article class="post">
  <header>
    
      <div class="icon"></div>
      <a href="/2021/04/09/操作系统：进程与线程/">
  <time datetime="2021-04-08T23:58:06.000Z">
    2021-04-09
  </time>
</a>
    
    
  
    <h1 class="title">操作系统：进程与线程</h1>
  

  </header>
  
  <div class="entry">
    
      <h3 id="&#x8FDB;&#x7A0B;&#x6982;&#x5FF5;">1. &#x8FDB;&#x7A0B;&#x6982;&#x5FF5;</h3>
<blockquote>
<p>&#x672A;&#x914D;&#x7F6E;OS&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x7A0B;&#x5E8F;&#x662F;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x7684;&#xFF1B;&#x5728;&#x591A;&#x9053;&#x7A0B;&#x5E8F;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x5141;&#x8BB8;&#x591A;&#x4E2A;&#x7A0B;&#x5E8F;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x3002;</p>
</blockquote>
<h4 id="&#x7A0B;&#x5E8F;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x7684;&#x7279;&#x5F81;">1.1 &#x7A0B;&#x5E8F;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x7684;&#x7279;&#x5F81;</h4>
<ol type="1">
<li>&#x987A;&#x5E8F;&#x6027;&#xFF1A;&#x5904;&#x7406;&#x673A;&#x64CD;&#x4F5C;&#x4E25;&#x683C;&#x6309;&#x7167;&#x6240;&#x89C4;&#x5B9A;&#x7684;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x3002;&#x5373;&#xFF1A;&#x672C;&#x64CD;&#x4F5C;&#x7ED3;&#x675F;&#x4E4B;&#x540E;&#x624D;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x4E0B;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x3002;</li>
<li>&#x5C01;&#x95ED;&#x6027;&#xFF1A;&#x7A0B;&#x5E8F;&#x5728;&#x5C01;&#x95ED;&#x73AF;&#x5883;&#x4E0B;&#x6267;&#x884C;&#x3002;&#x5373;&#xFF1A;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x65F6;&#x72EC;&#x5360;&#x5168;&#x673A;&#x8D44;&#x6E90;&#xFF0C;&#x8D44;&#x6E90;&#x7684;&#x72B6;&#x6001;&#x53EA;&#x6709;&#x672C;&#x7A0B;&#x5E8F;&#x624D;&#x80FD;&#x6539;&#x53D8;&#xFF0C;&#x7A0B;&#x5E8F;&#x4E00;&#x65E6;&#x6267;&#x884C;&#xFF0C;&#x5176;&#x7ED3;&#x679C;&#x4E0D;&#x53D7;&#x5916;&#x754C;&#x56E0;&#x7D20;&#x5E72;&#x6270;</li>
<li>&#x53EF;&#x518D;&#x73B0;&#x6027;&#xFF1A;&#x53EA;&#x8981;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x65F6;&#x7684;&#x73AF;&#x5883;&#x548C;&#x521D;&#x59CB;&#x6761;&#x4EF6;&#x76F8;&#x540C;&#xFF0C;&#x5F53;&#x7A0B;&#x5E8F;&#x91CD;&#x590D;&#x6267;&#x884C;&#x65F6;&#xFF0C;&#x90FD;&#x80FD;&#x7684;&#x5230;&#x76F8;&#x540C;&#x7684;&#x7ED3;&#x679C;&#x3002;</li>
</ol>
<p><strong>&#x6B63;&#x662F;&#x7531;&#x4E8E;&#x7A0B;&#x5E8F;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x7684;&#x8FD9;&#x4E9B;&#x7279;&#x70B9;&#xFF0C;&#x7ED9;&#x7A0B;&#x5E8F;&#x733F;debug&#x5E26;&#x6765;&#x4E86;&#x6781;&#x5927;&#x7684;&#x65B9;&#x4FBF;</strong></p>
<span id="more"></span>
<h4 id="&#x7A0B;&#x5E8F;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x7684;&#x7279;&#x5F81;">1.2 &#x7A0B;&#x5E8F;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x7684;&#x7279;&#x5F81;</h4>
<ol type="1">
<li><p>&#x95F4;&#x65AD;&#x6027;&#xFF1A;&#x7A0B;&#x5E8F;&#x5728;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x7531;&#x4E8E;&#x5171;&#x4EAB;&#x8D44;&#x6E90;&#x4EE5;&#x53CA;&#x4E3A;&#x5B8C;&#x6210;&#x540C;&#x4E00;&#x4EFB;&#x52A1;&#x800C;&#x5408;&#x4F5C;&#xFF0C;&#x81F4;&#x4F7F;&#x8FD9;&#x4E9B;&#x5E76;&#x53D1;&#x7684;&#x7A0B;&#x5E8F;&#x5F62;&#x6210;&#x4E86;&#x76F8;&#x4E92;&#x5236;&#x7EA6;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x4F8B;&#x5982;&#xFF1A;B&#x7684;&#x8BA1;&#x7B97;&#x5FC5;&#x987B;&#x8981;&#x4F7F;&#x7528;A&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x90A3;&#x4E48;&#x5728;A&#x672A;&#x8F93;&#x51FA;&#x65F6;&#x5019;B&#x5FC5;&#x987B;&#x7B49;&#x5F85;&#x3002;&#x5373;&#xFF1A;&#x6267;&#x884C;-&#x6682;&#x505C;-&#x6267;&#x884C;&#x8FD9;&#x79CD;&#x201C;&#x8D70;&#x8D70;&#x505C;&#x505C;&#x201D;&#x7684;&#x6D3B;&#x52A8;&#x89C4;&#x5F8B;&#x3002;</p></li>
<li><p>&#x5931;&#x53BB;&#x5C01;&#x95ED;&#x6027;&#xFF1A;&#x7531;&#x4E8E;&#x7A0B;&#x5E8F;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x65F6;&#x8D44;&#x6E90;&#x5171;&#x4EAB;&#xFF0C;&#x5373;&#xFF1A;&#x8BE5;&#x8D44;&#x6E90;&#x72B6;&#x6001;&#x53EF;&#x4EE5;&#x88AB;&#x591A;&#x4E2A;&#x7A0B;&#x5E8F;&#x66F4;&#x6539;&#xFF0C;&#x81F4;&#x4F7F;&#x7A0B;&#x5E8F;&#x5931;&#x53BB;&#x5C01;&#x95ED;&#x6027;&#x3002;&#x4F8B;&#x5982;&#xFF1A;&#x6253;&#x5370;&#x673A;&#x88AB;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5360;&#x7528;&#x65F6;&#xFF0C;&#x53E6;&#x5916;&#x7684;&#x7A0B;&#x5E8F;&#x5FC5;&#x987B;&#x7B49;&#x5F85;&#x3002;</p></li>
<li><p>&#x4E0D;&#x53EF;&#x518D;&#x73B0;&#x6027;&#xFF1A;&#x7A0B;&#x5E8F;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;&#x5931;&#x53BB;&#x4E86;&#x5C01;&#x95ED;&#x6027;&#xFF0C;&#x4E5F;&#x5BFC;&#x81F4;&#x5176;&#x5931;&#x53BB;&#x53EF;&#x518D;&#x73B0;&#x6027;&#x3002;&#x4F8B;&#x5982;&#xFF1A;A&#x7A0B;&#x5E8F;&#x4E0E;B&#x7A0B;&#x5E8F;&#x5171;&#x4EAB;&#x53D8;&#x91CF;x&#xFF0C;A&#x7A0B;&#x5E8F;&#x6BCF;&#x6267;&#x884C;&#x4E00;&#x6B21;x+1&#xFF0C;B&#x7A0B;&#x5E8F;&#x6BCF;&#x6267;&#x884C;&#x4E00;&#x6B21;&#x5148;Print(x)&#xFF0C;&#x540E;&#x5C06;x&#x7F6E;0&#x3002;&#x82E5;A&#xFF0C;B&#x4EE5;&#x4E0D;&#x540C;&#x901F;&#x5EA6;&#x8FD0;&#x884C;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x4EE5;&#x4E0B;&#x60C5;&#x51B5;&#xFF1A;</p>
<ol type="1">
<li>x = x + 1&#x5728;Print(x)&#x4E0E;x = 0 &#x4E4B;&#x524D;</li>
<li>x = x + 1&#x5728;Print(x)&#x4E0E;x = 0&#x4E4B;&#x95F4;</li>
<li>x = x + 1&#x5728;Print(x)&#x4E0E;x = 0 &#x4E4B;&#x540E;</li>
</ol>
<p>&#x4E0D;&#x540C;&#x7684;&#x60C5;&#x51B5;&#x5F97;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x5404;&#x4E0D;&#x76F8;&#x540C;&#x3002;</p></li>
</ol>
<h4 id="&#x8FDB;&#x7A0B;&#x7684;&#x7279;&#x5F81;">1.3 &#x8FDB;&#x7A0B;&#x7684;&#x7279;&#x5F81;</h4>
<blockquote>
<p>&#x591A;&#x9053;&#x7A0B;&#x5E8F;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x7531;&#x4E8E;&#x7A0B;&#x5E8F;&#x7684;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x4F1A;&#x4F7F;&#x5176;&#x5931;&#x53BB;&#x5C01;&#x95ED;&#x6027;&#x4E0E;&#x53EF;&#x518D;&#x73B0;&#x6027;&#x3002;&#x4E3A;&#x4F7F;&#x7A0B;&#x5E8F;&#x80FD;&#x591F;&#x5E76;&#x53D1;&#x6267;&#x884C;&#xFF0C;&#x4E14;&#x5BF9;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x7684;&#x7A0B;&#x5E8F;&#x52A0;&#x4EE5;&#x63CF;&#x8FF0;&#x4E0E;&#x63A7;&#x5236;&#xFF0C;&#x6545;&#xFF1A;&#x5F15;&#x5165;&#x201C;&#x8FDB;&#x7A0B;&#x7684;&#x6982;&#x5FF5;&#x201D;&#x3002;</p>
</blockquote>
<ol type="1">
<li>&#x7ED3;&#x6784;&#x7279;&#x5F81;&#xFF1A;<strong>&#x8FDB;&#x7A0B;&#x63A7;&#x5236;&#x5757;</strong>&#xFF0C;&#x5373;PCB&#xFF1B;&#x7531;<strong>&#x7A0B;&#x5E8F;&#x6BB5;&#xFF0C;&#x76F8;&#x5173;&#x6570;&#x636E;&#x6BB5;&#x548C;PCB</strong>&#x4E09;&#x90E8;&#x5206;&#x6784;&#x6210;&#x4E86;&#x8FDB;&#x7A0B;&#x5B9E;&#x4F53;&#x3002;&#x65E9;&#x671F;Unix&#x7248;&#x672C;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E09;&#x90E8;&#x5206;&#x603B;&#x79F0;&#x4E3A;&#x201C;&#x8FDB;&#x7A0B;&#x6620;&#x50CF;&#x201D;&#x3002;&#x4F8B;&#xFF1A;&#x6240;&#x8C13;&#x521B;&#x5EFA;&#x8FDB;&#x7A0B;&#xFF0C;&#x5B9E;&#x8D28;&#x4E0A;&#x662F;&#x521B;&#x5EFA;&#x8FDB;&#x7A0B;&#x5B9E;&#x4F53;&#x4E2D;&#x7684;PCB&#xFF0C;&#x64A4;&#x9500;&#x8FDB;&#x7A0B;&#xFF0C;&#x5B9E;&#x8D28;&#x4E0A;&#x662F;&#x64A4;&#x9500;&#x8FDB;&#x7A0B;&#x7684;PCB&#x3002;</li>
<li>&#x52A8;&#x6001;&#x6027;&#xFF1A;&#x8FDB;&#x7A0B;&#x7684;&#x5B9E;&#x8D28;&#x662F;&#x8FDB;&#x7A0B;&#x5B9E;&#x4F53;&#x7684;&#x4E00;&#x6B21;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x52A8;&#x6001;&#x6027;&#x662F;&#x8FDB;&#x7A0B;&#x7684;&#x6700;&#x57FA;&#x672C;&#x7279;&#x5F81;---&#x201C;&#x7531;&#x521B;&#x5EFA;&#x800C;&#x4EA7;&#x751F;&#xFF0C;&#x7531;&#x8C03;&#x5EA6;&#x800C;&#x6267;&#x884C;&#xFF0C;&#x7531;&#x64A4;&#x9500;&#x800C;&#x6D88;&#x4EA1;&#x201D;&#x3002;&#x8FDB;&#x7A0B;&#x5177;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x3002;&#x7A0B;&#x5E8F;&#x5219;&#x53EA;&#x662F;&#x4E00;&#x7EC4;&#x6709;&#x5E8F;&#x6307;&#x4EE4;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x662F;<strong>&#x9759;&#x6001;&#x7684;</strong>&#x3002;</li>
<li>&#x5E76;&#x53D1;&#x884C;&#xFF1A;<strong>&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#x5B9E;&#x4F53;&#x540C;&#x5B58;&#x5728;&#x4E8E;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x4E14;&#x80FD;&#x5728;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x540C;&#x65F6;&#x8FD0;&#x884C;</strong>&#x3002;&#x5E76;&#x53D1;&#x6027;&#x5BA4;&#x8FDB;&#x7A0B;&#x7684;&#x91CD;&#x8981;&#x7279;&#x5F81;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x662F;&#x6210;&#x4E3A;OS&#x7684;&#x91CD;&#x8981;&#x7279;&#x5F81;&#x3002;</li>
<li>&#x72EC;&#x7ACB;&#x6027;&#xFF1A;&#x8FDB;&#x7A0B;&#x5B9E;&#x4F53;&#x662F;&#x4E00;&#x4E2A;&#x80FD;&#x72EC;&#x7ACB;&#x8FD0;&#x884C;&#xFF0C;&#x72EC;&#x7ACB;&#x5206;&#x914D;&#x8D44;&#x6E90;&#x548C;&#x72EC;&#x7ACB;&#x63A5;&#x53D7;&#x8C03;&#x5EA6;&#x7684;&#x57FA;&#x672C;&#x5355;&#x4F4D;&#x3002;</li>
<li>&#x5F02;&#x6B65;&#x6027;&#xFF1A;&#x5404;&#x8FDB;&#x7A0B;&#x4EE5;&#x5404;&#x81EA;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x4E0D;&#x53EF;&#x9884;&#x77E5;&#x7684;&#x901F;&#x5EA6;&#x8FD0;&#x884C;&#x3002;</li>
</ol>
<p>&#x8FDB;&#x7A0B;&#x7684;&#x5B9A;&#x4E49;</p>
<ol type="1">
<li>&#x8FDB;&#x7A0B;&#x662F;&#x7A0B;&#x5E8F;&#x7684;&#x4E00;&#x6B21;&#x6267;&#x884C;&#x3002;</li>
<li>&#x8FDB;&#x7A0B;&#x662F;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x53CA;&#x5176;&#x6570;&#x636E;&#x5728;&#x5904;&#x7406;&#x673A;&#x4E0A;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x65F6;&#x6240;&#x53D1;&#x751F;&#x7684;&#x6D3B;&#x52A8;&#x3002;</li>
<li>&#x8FDB;&#x7A0B;&#x65F6;&#x7A0B;&#x5E8F;&#x5728;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x5408;&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5B83;&#x662F;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x8D44;&#x6E90;&#x5206;&#x914D;&#x548C;&#x8C03;&#x5EA6;&#x7684;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x5355;&#x4F4D;&#x3002;</li>
</ol>
<h4 id="&#x8FDB;&#x7A0B;&#x7684;&#x72B6;&#x6001;">1.4 &#x8FDB;&#x7A0B;&#x7684;&#x72B6;&#x6001;</h4>
<p>&#x4E09;&#x79CD;&#x57FA;&#x672C;&#x72B6;&#x6001;</p>
<ol type="1">
<li>&#x6267;&#x884C;&#x72B6;&#x6001;&#xFF1A;&#x8FDB;&#x7A0B;&#x5DF2;&#x83B7;&#x5F97;CPU&#xFF0C;&#x7A0B;&#x5E8F;&#x6B63;&#x5728;&#x6267;&#x884C;&#x3002;</li>
<li>&#x5C31;&#x7EEA;&#x72B6;&#x6001;&#xFF1A;&#x8FDB;&#x7A0B;&#x5DF2;&#x5206;&#x914D;&#x5230;&#x9664;CPU&#x4EE5;&#x5916;&#x7684;&#x6240;&#x6709;&#x5FC5;&#x8981;&#x8D44;&#x6E90;&#x540E;&#xFF0C;&#x53EA;&#x8981;&#x83B7;&#x5F97;CPU&#xFF0C;&#x4FBF;&#x53EF;&#x4EE5;&#x7ACB;&#x5373;&#x6267;&#x884C;&#x3002;&#x90A3;&#x4E48;&#x6B64;&#x65F6;&#x7684;&#x72B6;&#x6001;&#x79F0;&#x4E3A;&#x5C31;&#x7EEA;&#x72B6;&#x6001;&#x3002;&#x5904;&#x4E8E;&#x5C31;&#x7EEA;&#x72B6;&#x6001;&#x7684;&#x8FDB;&#x7A0B;&#x901A;&#x5E38;&#x5C06;&#x4ED6;&#x4EEC;&#x6392;&#x6210;&#x4E00;&#x4E2A;&#x961F;&#x5217;&#xFF0C;&#x79F0;&#x4E3A;&#x5C31;&#x7EEA;&#x961F;&#x5217;&#x3002;</li>
<li>&#x963B;&#x585E;&#x72B6;&#x6001;&#xFF1A;<strong>&#x6B63;&#x5728;&#x6267;&#x884C;</strong>&#x7684;&#x8FDB;&#x7A0B;&#x7531;&#x4E8E;&#x53D1;&#x751F;&#x67D0;&#x4E8B;&#x4EF6;&#x6682;&#x65F6;&#x65E0;&#x6CD5;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#xFF0C;&#x4FBF;&#x653E;&#x5F03;&#x5904;&#x7406;&#x673A;&#x800C;&#x5904;&#x4E8E;&#x6682;&#x505C;&#x72B6;&#x6001;&#xFF0C;&#x8FD9;&#x79CD;&#x6682;&#x505C;&#x72B6;&#x6001;&#x79F0;&#x4E3A;&#x963B;&#x585E;&#x72B6;&#x6001;&#x3002;&#x901A;&#x5E38;&#x4E5F;&#x5C06;&#x7531;&#x4E8E;&#x4E0D;&#x540C;&#x539F;&#x56E0;&#x9020;&#x6210;&#x963B;&#x585E;&#x7684;&#x8FDB;&#x7A0B;&#x6392;&#x6210;&#x4E00;&#x4E2A;&#x961F;&#x5217;&#xFF0C;&#x79F0;&#x4E3A;&#x963B;&#x585E;&#x961F;&#x5217;&#x3002;</li>
</ol>
<p>&#x6302;&#x8D77;&#x72B6;&#x6001;</p>
<ol type="1">
<li>&#x6302;&#x8D77;&#x72B6;&#x6001;&#x7684;&#x539F;&#x56E0;
<ol type="1">
<li>&#x7236;&#x8FDB;&#x7A0B;&#x8BF7;&#x6C42;&#x3002;</li>
<li>&#x8D1F;&#x8377;&#x8C03;&#x8282;&#x7684;&#x9700;&#x8981;&#x3002;&#x5B9E;&#x65F6;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x5DE5;&#x4F5C;&#x8D1F;&#x8377;&#x4E25;&#x91CD;&#xFF0C;&#x53EF;&#x80FD;&#x5F71;&#x54CD;&#x5230;&#x5BF9;&#x5B9E;&#x65F6;&#x4EFB;&#x52A1;&#x7684;&#x63A7;&#x5236;&#x65F6;&#xFF0C;&#x628A;&#x4E0D;&#x91CD;&#x8981;&#x7684;&#x8FDB;&#x7A0B;&#x6302;&#x8D77;&#xFF0C;&#x4FDD;&#x8BC1;&#x7CFB;&#x7EDF;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x3002;</li>
<li>&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x9700;&#x8981;&#x3002;</li>
<li>&#x7EC8;&#x7AEF;&#x7528;&#x6237;&#x7684;&#x8BF7;&#x6C42;&#x3002;</li>
</ol></li>
<li>&#x8FDB;&#x7A0B;&#x72B6;&#x6001;&#x7684;&#x8F6C;&#x6362;
<ol type="1">
<li>&#x6D3B;&#x52A8;&#x5C31;&#x7EEA;---&gt;&#x9759;&#x6B62;&#x5C31;&#x7EEA;&#x3002;&#x8FDB;&#x7A0B;&#x5904;&#x4E8E;&#x672A;&#x88AB;&#x6302;&#x8D77;&#x7684;&#x5C31;&#x7EEA;&#x72B6;&#x6001;Readya&#x65F6;&#xFF0C;&#x5F53;&#x7528;&#x6302;&#x8D77;&#x539F;&#x8BED;Suspend&#x5C06;&#x8BE5;&#x8FDB;&#x7A0B;&#x6302;&#x8D77;&#x540E;&#xFF0C;&#x8BE5;&#x8FDB;&#x7A0B;&#x4FBF;&#x8F6C;&#x6362;&#x4E3A;&#x9759;&#x6B62;&#x5C31;&#x7EEA;&#x72B6;&#x6001;Readys&#xFF0C;&#x6B64;&#x72B6;&#x6001;&#x7684;&#x8FDB;&#x7A0B;&#x4E0D;&#x518D;&#x88AB;&#x8C03;&#x5EA6;&#x6267;&#x884C;&#x3002;</li>
<li>&#x6D3B;&#x52A8;&#x963B;&#x585E;---&gt;&#x9759;&#x6B62;&#x963B;&#x585E;&#x3002;&#x8FDB;&#x7A0B;&#x5904;&#x4E8E;&#x672A;&#x88AB;&#x6302;&#x8D77;&#x7684;&#x963B;&#x585E;&#x72B6;&#x6001;Blockeda&#x65F6;&#xFF0C;&#x5F53;&#x7528;Suspend&#x5C06;&#x8BE5;&#x8FDB;&#x7A0B;&#x6302;&#x8D77;&#x540E;&#xFF0C;&#x8BE5;&#x8FDB;&#x7A0B;&#x8F6C;&#x6362;&#x4E3A;&#x9759;&#x6B62;&#x963B;&#x585E;&#x72B6;&#x6001;Blockeds&#xFF0C;&#x6B64;&#x72B6;&#x6001;&#x7684;&#x8FDB;&#x7A0B;&#x6240;&#x671F;&#x5F85;&#x7684;&#x65F6;&#x95F4;&#x51FA;&#x73B0;&#x540E;&#xFF0C;&#x72B6;&#x6001;&#x8F6C;&#x53D8;&#x4E3A;&#x9759;&#x6B62;&#x5C31;&#x7EEA;&#x72B6;&#x6001;&#x3002;</li>
<li>&#x9759;&#x6B62;&#x5C31;&#x7EEA;---&gt;&#x6D3B;&#x52A8;&#x5C31;&#x7EEA;&#x3002;&#x5904;&#x4E8E;Readys&#x72B6;&#x6001;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x7528;&#x6FC0;&#x6D3B;&#x539F;&#x8BED;Active&#x6FC0;&#x6D3B;&#x540E;&#xFF0C;&#x8FDB;&#x7A0B;&#x8F6C;&#x53D8;&#x4E3A;Readya&#x72B6;&#x6001;</li>
<li>&#x9759;&#x6B62;&#x963B;&#x585E;---&gt;&#x6D3B;&#x52A8;&#x963B;&#x585E;&#x3002;&#x5904;&#x4E8E;Blockeds&#x72B6;&#x6001;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x7528;Active&#x6FC0;&#x6D3B;&#x540E;&#xFF0C;&#x8FDB;&#x7A0B;&#x8F6C;&#x6362;&#x4E3A;Blockeda&#x72B6;&#x6001;&#x3002;</li>
</ol></li>
</ol>
<p>&#x521B;&#x5EFA;&#x72B6;&#x6001;&#x548C;&#x7EC8;&#x6B62;&#x72B6;&#x6001;</p>
<ol type="1">
<li>&#x521B;&#x5EFA;&#x72B6;&#x6001;&#x3002;&#x521B;&#x5EFA;&#x8FDB;&#x7A0B;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x6B65;&#x9AA4;&#xFF1A;1&#xFE0F;&#x20E3;&#x4E3A;&#x8FDB;&#x7A0B;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;PCB&#xFF0C;&#x586B;&#x5199;&#x5FC5;&#x8981;&#x4FE1;&#x606F;&#xFF1B;2&#xFE0F;&#x20E3;&#x628A;&#x8BE5;&#x8FDB;&#x7A0B;&#x8F6C;&#x4E3A;&#x5C31;&#x7EEA;&#x72B6;&#x6001;&#x5E76;&#x63D2;&#x5165;&#x5C31;&#x7EEA;&#x961F;&#x5217;&#x3002;&#x4E00;&#x822C;&#x800C;&#x8A00;&#xFF0C;&#x8FDB;&#x7A0B;&#x5DF2;&#x62E5;&#x6709;PCB&#xFF0C;&#x4F46;&#x6B64;&#x65F6;&#x8FD8;&#x672A;&#x8FDB;&#x5165;&#x4E3B;&#x5B58;&#xFF0C;&#x5373;&#x521B;&#x5EFA;&#x8FC7;&#x7A0B;&#x8FD8;&#x672A;&#x5B8C;&#x6210;&#xFF0C;&#x4E0D;&#x80FD;&#x8FDB;&#x884C;&#x8C03;&#x5EA6;&#x8FD0;&#x884C;&#x3002;&#x6B64;&#x65F6;&#x7684;&#x72B6;&#x6001;&#x4E3A;&#x521B;&#x5EFA;&#x72B6;&#x6001;&#x3002;</li>
<li>&#x7EC8;&#x6B62;&#x72B6;&#x6001;&#x3002;&#x7EC8;&#x6B62;&#x8FDB;&#x7A0B;&#x4E5F;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x6B65;&#x9AA4;&#xFF1A;1&#xFE0F;&#x20E3;&#x7B49;&#x5F85;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF1B;2&#xFE0F;&#x20E3;&#x5C06;PCB&#x6E05;0&#xFF0C;&#x5E76;&#x5C06;PCB&#x7A7A;&#x95F4;&#x8FD4;&#x8FD8;&#x7CFB;&#x7EDF;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x5230;&#x8FBE;&#x4E86;&#x81EA;&#x7136;&#x7ED3;&#x675F;&#x70B9;&#x6216;&#x662F;&#x51FA;&#x73B0;&#x4E86;&#x65E0;&#x6CD5;&#x514B;&#x670D;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x5C06;&#x8FDB;&#x5165;&#x7EC8;&#x6B62;&#x72B6;&#x6001;&#x3002;&#x8FDB;&#x5165;&#x7EC8;&#x6B62;&#x72B6;&#x6001;&#x7684;&#x8FDB;&#x7A0B;&#x4E0D;&#x80FD;&#x518D;&#x88AB;&#x6267;&#x884C;&#xFF0C;&#x4F46;&#x5728;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8FD9;&#x79CD;&#x4ECD;&#x7136;&#x4FDD;&#x7559;&#x4E00;&#x4E2A;&#x8BB0;&#x5F55;<code>(&#x72B6;&#x6001;&#x7801;&#xFF0C;&#x8BB0;&#x65F6;&#x7EDF;&#x8BA1;&#x6570;&#x636E;)</code>&#x4F9B;&#x5176;&#x4ED6;&#x8FDB;&#x7A0B;&#x6536;&#x96C6;&#xFF0C;&#x6536;&#x96C6;&#x7ED3;&#x675F;&#x548C;&#xFF0C;&#x5220;&#x9664;&#x8BE5;&#x8FDB;&#x7A0B;&#x3002;</li>
</ol>
<h4 id="&#x8FDB;&#x7A0B;&#x63A7;&#x5236;&#x5757;pcb">1.5 &#x8FDB;&#x7A0B;&#x63A7;&#x5236;&#x5757;PCB</h4>
<p>&#x8FDB;&#x7A0B;&#x63A7;&#x5236;&#x5757;&#x7684;&#x4F5C;&#x7528;</p>
<ol type="1">
<li>&#x4E3A;&#x4E86;&#x63CF;&#x8FF0;&#x548C;&#x63A7;&#x5236;&#x8FDB;&#x7A0B;&#x7684;&#x8FD0;&#x884C;&#xFF0C;&#x7CFB;&#x7EDF;&#x4E3A;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x7ED3;&#x6784;---&#x8FDB;&#x7A0B;&#x63A7;&#x5236;&#x5757;PCB&#x3002;&#x5B83;&#x662F;&#x8FDB;&#x7A0B;&#x5B9E;&#x4F53;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x662F;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x8BB0;&#x5F55;&#x578B;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;</li>
<li>&#x8FDB;&#x7A0B;&#x63A7;&#x5236;&#x5757;&#x4F5C;&#x7528;&#x662F;&#x4F7F;&#x4E00;&#x4E2A;&#x5728;&#x591A;&#x9053;&#x7A0B;&#x5E8F;&#x73AF;&#x5883;&#x4E0B;&#x4E0D;&#x80FD;&#x72EC;&#x7ACB;&#x8FD0;&#x884C;&#x7684;&#x7A0B;&#x5E8F;&#xFF08;&#x542B;&#x6570;&#x636E;&#xFF09;&#xFF0C;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x80FD;&#x72EC;&#x7ACB;&#x8FD0;&#x884C;&#x7684;&#x57FA;&#x672C;&#x5355;&#x4F4D;&#xFF0C;&#x4E00;&#x4E2A;&#x80FD;&#x4E0E;&#x5176;&#x4ED6;&#x8FDB;&#x7A0B;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x7684;&#x8FDB;&#x7A0B;&#x3002;</li>
<li>PCB&#x4E2D;&#x8BB0;&#x5F55;&#x4E86;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6240;&#x9700;&#x8981;&#x7684;&#xFF0C;&#x7528;&#x4E8E;&#x63CF;&#x8FF0;&#x8FDB;&#x7A0B;&#x7684;&#x5F53;&#x524D;&#x60C5;&#x51B5;&#x4EE5;&#x53CA;&#x63A7;&#x5236;&#x8FDB;&#x7A0B;&#x8FD0;&#x884C;&#x7684;&#x5168;&#x90E8;&#x4FE1;&#x606F;&#xFF1B;OS&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;PCB&#x6765;&#x5BF9;&#x5E76;&#x53D1;&#x7684;&#x8FDB;&#x7A0B;&#x8FDB;&#x884C;&#x63A7;&#x5236;&#x548C;&#x7BA1;&#x7406;&#x3002;</li>
</ol>
<p>&#x8FDB;&#x7A0B;&#x63A7;&#x5236;&#x5757;&#x7684;&#x4FE1;&#x606F;</p>
<ol type="1">
<li>&#x8FDB;&#x7A0B;&#x6807;&#x793A;&#x7B26;
<ol type="1">
<li>&#x8FDB;&#x7A0B;&#x6807;&#x793A;&#x7B26;&#x7528;&#x4E8E;&#x552F;&#x4E00;&#x5730;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;</li>
<li>&#x5185;&#x90E8;&#x6807;&#x8BC6;&#x7B26;&#x3002;&#x6240;&#x6709;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x90FD;&#x4E3A;&#x6BCF;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x8D4B;&#x4E88;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x7684;&#x6570;&#x5B57;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x5E8F;&#x53F7;&#x3002;&#x8BBE;&#x7F6E;&#x5185;&#x90E8;&#x6807;&#x8BC6;&#x7B26;&#x4E3B;&#x8981;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x7CFB;&#x7EDF;&#x4F7F;&#x7528;</li>
<li>&#x5916;&#x90E8;&#x6807;&#x8BC6;&#x7B26;&#x3002;&#x7531;&#x521B;&#x5EFA;&#x8005;&#x63D0;&#x4F9B;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x7531;&#x5B57;&#x6BCD;&#xFF0C;&#x6570;&#x5B57;&#x7EC4;&#x6210;&#xFF0C;&#x5F80;&#x5F80;&#x7531;&#x7528;&#x6237;&#x5728;&#x8BBF;&#x95EE;&#x8BE5;&#x8FDB;&#x7A0B;&#x65F6;&#x4F7F;&#x7528;&#x3002;</li>
</ol></li>
<li>&#x5904;&#x7406;&#x673A;&#x72B6;&#x6001;
<ol type="1">
<li>&#x5904;&#x7406;&#x673A;&#x72B6;&#x6001;&#x4FE1;&#x606F;&#x4E3B;&#x8981;&#x7531;&#x5904;&#x7406;&#x673A;&#x7684;&#x5404;&#x79CD;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x7EC4;&#x6210;&#x3002;</li>
<li>&#x5904;&#x7406;&#x673A;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x4FE1;&#x606F;&#x653E;&#x5728;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#xFF0C;&#x5F53;&#x5904;&#x7406;&#x673A;&#x88AB;&#x4E2D;&#x65AD;&#x65F6;&#xFF0C;&#x6240;&#x6709;&#x4FE1;&#x606F;&#x5FC5;&#x987B;&#x4FDD;&#x5B58;&#x5728;PCB&#x4E2D;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728;&#x8BE5;&#x8FDB;&#x7A0B;&#x91CD;&#x65B0;&#x6267;&#x884C;&#x65F6;&#xFF0C;&#x80FD;&#x591F;&#x4ECE;&#x65AD;&#x70B9;&#x7EE7;&#x7EED;&#x6267;&#x884C;</li>
<li>&#x901A;&#x7528;&#x5BC4;&#x5B58;&#x5668;&#xFF1A;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#xFF0C;&#x6682;&#x5B58;&#x4FE1;&#x606F;</li>
<li>&#x6307;&#x4EE4;&#x8BA1;&#x6570;&#x5668;&#xFF1A;&#x5B58;&#x653E;&#x4E86;&#x8981;&#x8BBF;&#x95EE;&#x4E0B;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x7684;&#x5730;&#x5740;</li>
<li>&#x7A0B;&#x5E8F;&#x72B6;&#x6001;&#x5B57;PSW&#xFF1A;&#x542B;&#x6709;&#x72B6;&#x6001;&#x4FE1;&#x606F;&#xFF0C;&#x5982;&#xFF1A;&#x6761;&#x4EF6;&#x7801;&#xFF0C;&#x6267;&#x884C;&#x65B9;&#x5F0F;&#xFF0C;&#x4E2D;&#x65AD;&#x5C4F;&#x853D;&#x6807;&#x5FD7;</li>
<li>&#x7528;&#x6237;&#x6808;&#x6307;&#x9488;&#xFF1A;&#x7528;&#x4E8E;&#x5B58;&#x653E;&#x8FC7;&#x7A0B;&#x548C;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x53C2;&#x6570;&#x53CA;&#x8C03;&#x7528;&#x5730;&#x5740;&#xFF0C;&#x6808;&#x6307;&#x9488;&#x6307;&#x5411;&#x8BE5;&#x6808;&#x7684;&#x6808;&#x9876;</li>
</ol></li>
<li>&#x8FDB;&#x7A0B;&#x8C03;&#x5EA6;&#x4FE1;&#x606F;
<ol type="1">
<li>&#x8FDB;&#x7A0B;&#x72B6;&#x6001;&#x3002;&#x6307;&#x660E;&#x8FDB;&#x7A0B;&#x7684;&#x5F53;&#x524D;&#x72B6;&#x6001;&#xFF0C;&#x4F5C;&#x4E3A;&#x8FDB;&#x7A0B;&#x8C03;&#x5EA6;&#x548C;&#x5BF9;&#x6362;&#x65F6;&#x7684;&#x4F9D;&#x636E;</li>
<li>&#x8FDB;&#x7A0B;&#x4F18;&#x5148;&#x7EA7;&#x3002;&#x7528;&#x4E8E;&#x63CF;&#x8FF0;&#x8FDB;&#x7A0B;&#x548C;&#x5904;&#x7406;&#x673A;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x522B;&#x7684;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#xFF0C;&#x4F18;&#x5148;&#x7EA7;&#x9AD8;&#x7684;&#x8FDB;&#x7A0B;&#x6709;&#x9650;&#x83B7;&#x5F97;&#x5904;&#x7406;&#x673A;</li>
<li>&#x8FDB;&#x7A0B;&#x8C03;&#x5EA6;&#x6240;&#x9700;&#x7684;&#x5176;&#x4ED6;&#x4FE1;&#x606F;&#x3002;&#x5982;&#xFF0C;&#x8C03;&#x5EA6;&#x6240;&#x91C7;&#x7528;&#x7684;&#x7B97;&#x6CD5;</li>
<li>&#x4E8B;&#x4EF6;&#x3002;&#x6307;&#x8FDB;&#x7A0B;&#x7531;&#x6267;&#x884C;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x4E3A;&#x963B;&#x585E;&#x72B6;&#x6001;&#x6240;&#x7B49;&#x5F85;&#x7684;&#x53D1;&#x751F;&#x4E8B;&#x4EF6;&#x3002;&#x5373;&#xFF1A;&#x963B;&#x585E;&#x539F;&#x56E0;</li>
</ol></li>
<li>&#x8FDB;&#x7A0B;&#x63A7;&#x5236;&#x4FE1;&#x606F;
<ol type="1">
<li>&#x7A0B;&#x5E8F;&#x548C;&#x6570;&#x636E;&#x7684;&#x5730;&#x5740;&#x3002;&#x6307;&#x8FDB;&#x7A0B;&#x7684;&#x7A0B;&#x5E8F;&#x548C;&#x6570;&#x636E;&#x6240;&#x5728;&#x7684;&#x5185;&#x5B58;&#x6216;&#x5916;&#x5B58;&#x5730;&#x5740;&#xFF0C;&#x4EE5;&#x4FBF;&#x8C03;&#x5EA6;&#x5230;&#x8BE5;&#x8FDB;&#x7A0B;&#x65F6;&#xFF0C;&#x80FD;&#x4ECE;PCB&#x4E2D;&#x627E;&#x5230;&#x5176;&#x7A0B;&#x5E8F;&#x548C;&#x6570;&#x636E;</li>
<li>&#x8FDB;&#x7A0B;&#x540C;&#x6B65;&#x548C;&#x901A;&#x4FE1;&#x673A;&#x5236;&#x3002;&#x5B9E;&#x73B0;&#x8FDB;&#x7A0B;&#x540C;&#x6B65;&#x548C;&#x901A;&#x4FE1;&#x5FC5;&#x987B;&#x7684;&#x673A;&#x5236;&#x3002;&#x5982;&#xFF1A;&#x4FE1;&#x53F7;&#x91CF;&#xFF0C;&#x6D88;&#x606F;&#x961F;&#x5217;&#x7B49;</li>
<li>&#x8D44;&#x6E90;&#x6E05;&#x5355;&#x3002;&#x9664;CPU&#x5916;&#xFF0C;&#x8FDB;&#x7A0B;&#x6240;&#x9700;&#x8981;&#x7684;&#x5168;&#x90E8;&#x8D44;&#x6E90;</li>
<li>&#x94FE;&#x63A5;&#x6307;&#x9488;&#x3002;&#x7ED9;&#x51FA;&#x672C;&#x8FDB;&#x7A0B;PCB&#x6240;&#x5728;&#x961F;&#x5217;&#x4E2D;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;PCB&#x5730;&#x5740;</li>
</ol></li>
</ol>
<p>&#x8FDB;&#x7A0B;&#x63A7;&#x5236;&#x5757;&#x7684;&#x7EC4;&#x7EC7;&#x65B9;&#x5F0F;</p>
<ol type="1">
<li>&#x94FE;&#x63A5;&#x65B9;&#x5F0F;&#x3002;&#x628A;&#x5177;&#x6709;&#x540C;&#x4E00;&#x72B6;&#x6001;&#x7684;PCB&#x7528;&#x5176;&#x4E2D;&#x7684;&#x94FE;&#x63A5;&#x5B57;&#x8FDE;&#x6210;&#x4E00;&#x4E2A;&#x961F;&#x5217;&#x3002;</li>
<li><img src="https://supers1.oss-cn-hangzhou.aliyuncs.com/20210409140031.png" style="zoom:50%;"></li>
<li>&#x7D22;&#x5F15;&#x65B9;&#x5F0F;&#x3002;&#x7CFB;&#x7EDF;&#x6839;&#x636E;&#x6240;&#x6709;&#x7684;&#x8FDB;&#x7A0B;&#x5EFA;&#x7ACB;PCB&#x7D22;&#x5F15;&#x8868;&#x3002;&#x5982;&#xFF1A;&#x5C31;&#x7EEA;&#x7D22;&#x5F15;&#x8868;&#xFF0C;&#x963B;&#x585E;&#x7D22;&#x5F15;&#x8868;</li>
<li><img src="https://supers1.oss-cn-hangzhou.aliyuncs.com/20210409135947.png" style="zoom:50%;"></li>
</ol>
<h3 id="&#x8FDB;&#x7A0B;&#x63A7;&#x5236;">2. &#x8FDB;&#x7A0B;&#x63A7;&#x5236;</h3>
<blockquote>
<p>&#x8FDB;&#x7A0B;&#x63A7;&#x5236;&#x662F;&#x8FDB;&#x7A0B;&#x7BA1;&#x7406;&#x4E2D;&#x6700;&#x57FA;&#x672C;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x8FDB;&#x7A0B;&#x63A7;&#x5236;&#xFF1A;&#x521B;&#x5EFA;&#x8FDB;&#x7A0B;&#xFF0C;&#x7EC8;&#x6B62;&#x8FDB;&#x7A0B;&#xFF0C;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x7B49;&#x7B49;</p>
<p>&#x8FDB;&#x7A0B;&#x63A7;&#x5236;&#x4E00;&#x822C;&#x662F;&#x7531;OS&#x7684;&#x5185;&#x6838;&#x4E2D;&#x7684;&#x539F;&#x8BED;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#x3002;</p>
</blockquote>
<p>&#x539F;&#x8BED;&#xFF1A;&#x7531;&#x82E5;&#x5E72;&#x6761;&#x6307;&#x4EE4;&#x7EC4;&#x6210;&#x7684;&#xFF0C;&#x7528;&#x4E8E;&#x5B8C;&#x6210;&#x4E00;&#x5B9A;&#x529F;&#x80FD;&#x7684;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x3002;&#x662F;&#x201C;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#x201D;---&#x6307;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x52A8;&#x4F5C;&#x8981;&#x4E48;&#x5168;&#x505A;&#xFF0C;&#x8981;&#x4E48;&#x5168;&#x4E0D;&#x505A;&#xFF0C;&#x662F;&#x4E0D;&#x53EF;&#x5206;&#x5272;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x5141;&#x8BB8;&#x88AB;&#x4E2D;&#x65AD;&#xFF0C;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#x5728;<strong>&#x7BA1;&#x6001;</strong>&#x4E0B;&#x6267;&#x884C;&#xFF0C;&#x5E38;&#x9A7B;&#x5185;&#x5B58;&#x3002;</p>
<p>&#x539F;&#x8BED;&#x7684;&#x4F5C;&#x7528;&#xFF1A;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x8FDB;&#x7A0B;&#x7684;&#x901A;&#x4FE1;&#x548C;&#x63A7;&#x5236;&#x3002;</p>
<h4 id="&#x8FDB;&#x7A0B;&#x521B;&#x5EFA;">2.1 &#x8FDB;&#x7A0B;&#x521B;&#x5EFA;</h4>
<blockquote>
<p>&#x5B50;&#x8FDB;&#x7A0B;&#x53EF;&#x4EE5;&#x62E5;&#x6709;&#x7236;&#x8FDB;&#x7A0B;&#x6240;&#x62E5;&#x6709;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x64A4;&#x9500;&#x7236;&#x8FDB;&#x7A0B;&#x65F6;&#xFF0C;&#x4E5F;&#x5FC5;&#x987B;&#x540C;&#x65F6;&#x64A4;&#x9500;&#x5176;&#x6240;&#x6709;&#x5B50;&#x8FDB;&#x7A0B;</p>
</blockquote>
<ol type="1">
<li>&#x7533;&#x8BF7;&#x7A7A;&#x767D;PCB&#x3002;&#x4E3A;&#x65B0;&#x8FDB;&#x7A0B;&#x7533;&#x8BF7;&#x83B7;&#x5F97;&#x552F;&#x4E00;&#x7684;&#x6570;&#x5B57;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x5E76;&#x4ECE;PCB&#x96C6;&#x5408;&#x4E2D;&#x7D22;&#x53D6;&#x4E00;&#x4E2A;&#x7A7A;&#x767D;PCB</li>
<li>&#x4E3A;&#x65B0;&#x8FDB;&#x7A0B;&#x5206;&#x914D;&#x8D44;&#x6E90;&#x3002;&#x4E3A;&#x65B0;&#x8FDB;&#x7A0B;&#x5206;&#x914D;&#x5FC5;&#x8981;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;</li>
<li>&#x521D;&#x59CB;&#x5316;&#x8FDB;&#x7A0B;&#x63A7;&#x5236;&#x5757;&#x3002;PCB&#x7684;&#x521D;&#x59CB;&#x5316;&#x5305;&#x62EC;
<ol type="1">
<li>&#x521D;&#x59CB;&#x5316;&#x6807;&#x793A;&#x4FE1;&#x606F;&#x3002;&#x5C06;&#x7CFB;&#x7EDF;&#x5206;&#x914D;&#x7684;&#x6807;&#x793A;&#x7B26;&#x548C;&#x7236;&#x8FDB;&#x7A0B;&#x6807;&#x793A;&#x7B26;&#x586B;&#x5165;PCB&#x3002;</li>
<li>&#x521D;&#x59CB;&#x5316;&#x5904;&#x7406;&#x673A;&#x72B6;&#x6001;&#x4FE1;&#x606F;&#x3002;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#x53EA;&#x60F3;&#x7A0B;&#x5E8F;&#x7684;&#x5165;&#x53E3;&#x5730;&#x5740;&#xFF0C;&#x4F7F;&#x6808;&#x6307;&#x9488;&#x6307;&#x5411;&#x6808;&#x9876;&#x3002;</li>
<li>&#x521D;&#x59CB;&#x5316;&#x5904;&#x7406;&#x673A;&#x63A7;&#x5236;&#x4FE1;&#x606F;&#x3002;&#x5C06;&#x8FDB;&#x7A0B;&#x7684;&#x72B6;&#x6001;&#x8BBE;&#x7F6E;&#x4E3A;&#x5C31;&#x7EEA;&#x72B6;&#x6001;&#x6216;&#x9759;&#x6B62;&#x5C31;&#x7EEA;&#x72B6;&#x6001;&#xFF1B;&#x4F18;&#x5148;&#x7EA7;&#x901A;&#x5E38;&#x8BBE;&#x7F6E;&#x4E3A;&#x6700;&#x4F4E;&#x4F18;&#x5148;&#x7EA7;&#x3002;</li>
</ol></li>
<li>&#x5C06;&#x65B0;&#x8FDB;&#x7A0B;&#x63D2;&#x5165;&#x5C31;&#x7EEA;&#x961F;&#x5217;</li>
</ol>
<h4 id="&#x8FDB;&#x7A0B;&#x7EC8;&#x6B62;">2.2 &#x8FDB;&#x7A0B;&#x7EC8;&#x6B62;</h4>
<ol type="1">
<li>&#x6839;&#x636E;&#x88AB;&#x7EC8;&#x6B62;&#x8FDB;&#x7A0B;&#x7684;&#x6807;&#x793A;&#x7B26;&#x3002;&#x4ECE;PCB&#x96C6;&#x5408;&#x4E2D;&#x68C0;&#x7D22;&#x51FA;&#x8BE5;&#x8FDB;&#x7A0B;&#x7684;PCB&#xFF0C;&#x4ECE;&#x4E2D;&#x8BFB;&#x51FA;&#x8BE5;&#x8FDB;&#x7A0B;&#x7684;&#x72B6;&#x6001;&#x3002;</li>
<li>&#x82E5;&#x88AB;&#x7EC8;&#x6B62;&#x8FDB;&#x7A0B;&#x6B63;&#x5904;&#x4E8E;&#x6267;&#x884C;&#x72B6;&#x6001;&#xFF0C;&#x5219;&#x7ACB;&#x5373;&#x7EC8;&#x6B62;&#x8BE5;&#x8FDB;&#x7A0B;&#x7684;&#x6267;&#x884C;&#xFF0C;&#x5E76;&#x7F6E;&#x8C03;&#x5EA6;&#x6807;&#x5FD7;&#x4E3A;&#x771F;&#xFF0C;&#x7528;&#x4E8E;&#x6307;&#x793A;&#x8BE5;&#x8FDB;&#x7A0B;&#x88AB;&#x7EC8;&#x6B62;&#x540E;&#x5E94;&#x8BE5;&#x91CD;&#x65B0;&#x8FDB;&#x884C;&#x8C03;&#x5EA6;</li>
<li>&#x82E5;&#x8BE5;&#x8FDB;&#x7A0B;&#x8FD8;&#x6709;&#x5B50;&#x5B59;&#x8FDB;&#x7A0B;&#xFF0C;&#x5E94;&#x5C06;&#x5176;&#x6240;&#x6709;&#x5B50;&#x5B59;&#x8FDB;&#x7A0B;&#x5168;&#x90E8;&#x7EC8;&#x6B62;&#xFF0C;&#x4EE5;&#x9632;&#x6210;&#x4E3A;&#x4E0D;&#x53EF;&#x63A7;&#x8FDB;&#x7A0B;</li>
<li>&#x5C06;&#x88AB;&#x7EC8;&#x6B62;&#x8FDB;&#x7A0B;&#x62E5;&#x6709;&#x7684;&#x6240;&#x6709;&#x8D44;&#x6E90;&#xFF0C;&#x5F52;&#x8FD8;&#x7ED9;&#x7236;&#x8FDB;&#x7A0B;&#x6216;&#x7CFB;&#x7EDF;</li>
<li>&#x5C06;&#x88AB;&#x7EC8;&#x6B62;&#x8FDB;&#x7A0B;PCB&#x4ECE;&#x6240;&#x5728;&#x961F;&#x5217;&#x4E2D;&#x79FB;&#x9664;&#xFF0C;&#x7B49;&#x5F85;&#x5176;&#x4ED6;&#x7A0B;&#x5E8F;&#x6765;&#x641C;&#x96C6;&#x4FE1;&#x606F;&#xFF0C;&#x641C;&#x96C6;&#x5B8C;&#x6BD5;&#x540E;&#x5220;&#x9664;&#x3002;</li>
</ol>
<h4 id="&#x8FDB;&#x7A0B;&#x963B;&#x585E;&#x4E0E;&#x5524;&#x9192;">2.3 &#x8FDB;&#x7A0B;&#x963B;&#x585E;&#x4E0E;&#x5524;&#x9192;</h4>
<p>&#x8FDB;&#x7A0B;&#x963B;&#x585E;</p>
<ol type="1">
<li>&#x8FDB;&#x7A0B;&#x7684;&#x963B;&#x585E;&#x662F;&#x4E00;&#x79CD;&#x4E3B;&#x52A8;&#x884C;&#x4E3A;</li>
<li>&#x6B63;&#x5728;&#x6267;&#x884C;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x7531;&#x4E8E;&#x67D0;&#x4E8B;&#x4EF6;&#x65E0;&#x6CD5;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#xFF0C;&#x4E8E;&#x662F;&#x8C03;&#x7528;<strong>&#x963B;&#x585E;&#x539F;&#x8BED;block</strong>&#x5C06;&#x81EA;&#x5DF1;&#x963B;&#x585E;</li>
<li>&#x8FDB;&#x5165;block&#x8FC7;&#x7A0B;&#x540E;&#xFF0C;&#x7531;&#x4E8E;&#x6B64;&#x65F6;&#x8BE5;&#x8FDB;&#x7A0B;&#x8FD8;&#x5904;&#x4E8E;&#x6267;&#x884C;&#x72B6;&#x6001;&#xFF0C;&#x6240;&#x4EE5;&#x5E94;&#x5148;&#x7ACB;&#x5373;&#x505C;&#x6B62;&#x6267;&#x884C;&#xFF0C;&#x628A;&#x8FDB;&#x7A0B;&#x63A7;&#x5236;&#x5757;&#x7684;&#x73B0;&#x884C;&#x72B6;&#x6001;&#x7531;&#x201C;&#x6267;&#x884C;&#x201D;&#x6539;&#x4E3A;&#x201C;&#x963B;&#x585E;&#x201D;&#xFF0C;&#x5E76;&#x5C06;PCB&#x63D2;&#x5165;&#x963B;&#x585E;&#x961F;&#x5217;&#x3002;</li>
</ol>
<p>&#x8FDB;&#x7A0B;&#x5524;&#x9192;</p>
<ol type="1">
<li>&#x5F53;&#x963B;&#x585E;&#x8FDB;&#x7A0B;&#x6240;&#x671F;&#x5F85;&#x7684;&#x65F6;&#x95F4;&#x51FA;&#x73B0;&#x65F6;&#xFF0C;&#x7531;&#x6709;&#x5173;&#x8FDB;&#x7A0B;&#x8C03;&#x7528;&#x5524;&#x9192;&#x539F;&#x8BED;wakeup()&#xFF0C;&#x5E76;&#x5C06;&#x8BE5;&#x4E8B;&#x4EF6;&#x7684;&#x8FDB;&#x7A0B;&#x5524;&#x9192;&#x3002;</li>
<li>&#x9996;&#x5148;&#x628A;&#x88AB;&#x963B;&#x585E;&#x8FDB;&#x7A0B;&#x4ECE;&#x963B;&#x585E;&#x961F;&#x5217;&#x4E2D;&#x79FB;&#x51FA;&#xFF0C;&#x5C06;&#x5176;PCB&#x7684;&#x73B0;&#x884C;&#x72B6;&#x6001;&#x7531;&#x201C;&#x963B;&#x585E;&#x201D;&#x6539;&#x4E3A;&#x201C;&#x5C31;&#x7EEA;&#x201D;&#xFF0C;&#x5C06;&#x5176;&#x63D2;&#x5165;&#x5230;&#x5C31;&#x7EEA;&#x961F;&#x5217;&#x4E2D;</li>
</ol>
<p>block&#x539F;&#x8BED;&#x8BED;wakeup&#x539F;&#x8BED;&#x662F;&#x4E00;&#x5BF9;&#x4F5C;&#x7528;&#x521A;&#x597D;&#x76F8;&#x53CD;&#x7684;&#x539F;&#x8BED;&#x3002;</p>
<h4 id="&#x8FDB;&#x7A0B;&#x7684;&#x6302;&#x8D77;&#x4E0E;&#x6FC0;&#x6D3B;">2.4 &#x8FDB;&#x7A0B;&#x7684;&#x6302;&#x8D77;&#x4E0E;&#x6FC0;&#x6D3B;</h4>
<p>&#x8FDB;&#x7A0B;&#x6302;&#x8D77;</p>
<ol type="1">
<li>&#x7CFB;&#x7EDF;&#x5229;&#x7528;suspend()&#x539F;&#x8BED;&#x5C06;&#x5236;&#x5B9A;&#x8FDB;&#x7A0B;&#x6216;&#x5904;&#x4E8E;&#x963B;&#x585E;&#x72B6;&#x6001;&#x7684;&#x8FDB;&#x7A0B;&#x6302;&#x8D77;</li>
<li>&#x68C0;&#x67E5;&#x88AB;&#x6302;&#x8D77;&#x8FDB;&#x7A0B;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x82E5;&#x5904;&#x4E8E;&#x6D3B;&#x52A8;&#x5C31;&#x7EEA;&#x6001;&#xFF0C;&#x4FBF;&#x5C06;&#x5176;&#x8F6C;&#x6362;&#x4E3A;&#x9759;&#x6B62;&#x5C31;&#x7EEA;&#x6001;&#xFF1B;&#x6D3B;&#x52A8;&#x963B;&#x585E;&#x6001;&#xFF0C;&#x5219;&#x5C06;&#x5176;&#x8F6C;&#x6362;&#x4E3A;&#x9759;&#x6B62;&#x963B;&#x585E;&#x6001;</li>
<li>&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x7528;&#x6237;&#x6216;&#x7236;&#x8FDB;&#x7A0B;&#x8003;&#x67E5;&#x8BE5;&#x8FDB;&#x7A0B;&#x7684;&#x8FD0;&#x884C;&#x60C5;&#x51B5;&#x800C;&#x628A;&#x8BE5;&#x8FDB;&#x7A0B;&#x7684;PCB&#x590D;&#x5236;&#x5230;&#x67D0;&#x6307;&#x5B9A;&#x7684;&#x5185;&#x5B58;&#x533A;&#x57DF;&#x3002;&#x82E5;&#x88AB;&#x6302;&#x8D77;&#x7684;&#x8FDB;&#x7A0B;&#x6B63;&#x5728;&#x6267;&#x884C;&#xFF0C;&#x5219;&#x91CD;&#x65B0;&#x8C03;&#x5EA6;&#x3002;</li>
</ol>
<p>&#x8FDB;&#x7A0B;&#x6FC0;&#x6D3B;</p>
<ol type="1">
<li>&#x7CFB;&#x7EDF;&#x5229;&#x7528;active()&#x539F;&#x8BED;&#x5C06;&#x5236;&#x5B9A;&#x8FDB;&#x7A0B;&#x6FC0;&#x6D3B;</li>
<li>&#x6FC0;&#x6D3B;&#x539F;&#x8BED;&#x5148;&#x5C06;&#x8FDB;&#x7A0B;&#x4ECE;&#x5916;&#x5B58;&#x6362;&#x5165;&#x5185;&#x5B58;&#x3002;&#x68C0;&#x67E5;&#x8BE5;&#x8FDB;&#x7A0B;&#x7684;&#x73B0;&#x884C;&#x72B6;&#x6001;&#xFF0C;&#x82E5;&#x9759;&#x6B62;&#x5C31;&#x7EEA;&#xFF0C;&#x5C06;&#x5176;&#x6539;&#x4E3A;&#x6D3B;&#x52A8;&#x5C31;&#x7EEA;&#xFF1B;&#x82E5;&#x4E3A;&#x9759;&#x6B62;&#x963B;&#x585E;&#x5C06;&#x5176;&#x6539;&#x4E3A;&#x6D3B;&#x52A8;&#x963B;&#x585E;</li>
<li>&#x5047;&#x5982;&#x91C7;&#x7528;&#x7684;&#x662F;&#x62A2;&#x5360;&#x5F0F;&#x8C03;&#x5EA6;&#x7B56;&#x7565;&#xFF0C;&#x6BCF;&#x5F53;&#x6709;&#x65B0;&#x8FDB;&#x7A0B;&#x8FDB;&#x5165;&#x5C31;&#x7EEA;&#x961F;&#x5217;&#x65F6;&#xFF0C;&#x5E94;&#x68C0;&#x67E5;&#x662F;&#x5426;&#x8FDB;&#x884C;&#x91CD;&#x65B0;&#x8C03;&#x5EA6;</li>
</ol>
<h3 id="&#x8FDB;&#x7A0B;&#x540C;&#x6B65;">3. &#x8FDB;&#x7A0B;&#x540C;&#x6B65;</h3>
<blockquote>
<p>OS&#x5F15;&#x5165;&#x8FDB;&#x7A0B;&#x4E4B;&#x540E;&#xFF0C;&#x867D;&#x7136;&#x63D0;&#x9AD8;&#x4E86;&#x8D44;&#x6E90;&#x7684;&#x5229;&#x7528;&#x7387;&#x548C;&#x7CFB;&#x7EDF;&#x7684;&#x541E;&#x5410;&#x91CF;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x8FDB;&#x7A0B;&#x7684;&#x5F02;&#x6B65;&#x6027;&#xFF0C;&#x5728;&#x4ED6;&#x4EEC;&#x4E89;&#x7528;&#x4E34;&#x754C;&#x8D44;&#x6E90;&#x65F6;&#x4F1A;&#x9020;&#x6210;&#x7CFB;&#x7EDF;&#x6DF7;&#x4E71;&#x3002;</p>
<p>&#x8FDB;&#x7A0B;&#x540C;&#x6B65;&#x7684;&#x4E3B;&#x8981;&#x4EFB;&#x52A1;&#xFF1A;&#x5BF9;&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#x5728;&#x6267;&#x884C;&#x7684;&#x6B21;&#x5E8F;&#x4E0A;&#x8FDB;&#x884C;&#x534F;&#x8C03;&#xFF0C;&#x4EE5;&#x4F7F;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x7684;&#x8BF8;&#x591A;&#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x80FD;&#x591F;&#x6709;&#x6548;&#x5730;&#x5171;&#x4EAB;&#x8D44;&#x6E90;&#x548C;&#x76F8;&#x4E92;&#x5408;&#x4F5C;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x7A0B;&#x5E8F;&#x7684;&#x6267;&#x884C;&#x5177;&#x6709;&#x53EF;&#x518D;&#x73B0;&#x6027;&#x3002;</p>
</blockquote>
<h4 id="&#x8FDB;&#x7A0B;&#x540C;&#x6B65;&#x6982;&#x5FF5;">3.1 &#x8FDB;&#x7A0B;&#x540C;&#x6B65;&#x6982;&#x5FF5;</h4>
<p>&#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x7684;&#x4E24;&#x79CD;&#x5236;&#x7EA6;&#x5173;&#x7CFB;</p>
<ol type="1">
<li>&#x95F4;&#x63A5;&#x76F8;&#x4E92;&#x5236;&#x7EA6;&#x5173;&#x7CFB;&#x3002;&#x540C;&#x5904;&#x4E8E;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x901A;&#x5E38;&#x90FD;&#x5171;&#x4EAB;&#x7740;&#x67D0;&#x79CD;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x3002;&#x4F8B;&#x5982;&#xFF1A;&#x6253;&#x5370;&#x673A;&#x88AB;A&#x8FDB;&#x7A0B;&#x5360;&#x6709;&#x65F6;&#xFF0C;&#x90A3;&#x4E48;&#x6B64;&#x65F6;&#x9700;&#x8981;&#x6253;&#x5370;&#x673A;&#x7684;B&#x8FDB;&#x7A0B;&#x53EA;&#x80FD;&#x963B;&#x585E;</li>
<li>&#x76F4;&#x63A5;&#x76F8;&#x4E92;&#x5236;&#x7EA6;&#x5173;&#x7CFB;&#x3002;&#x8FD9;&#x79CD;&#x5236;&#x7EA6;&#x5173;&#x7CFB;&#x4E3B;&#x8981;&#x6E90;&#x4E8E;&#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x7684;&#x5408;&#x4F5C;&#x3002;</li>
</ol>
<p>&#x4E34;&#x754C;&#x8D44;&#x6E90;&#x3002;&#x8BF8;&#x5982;&#xFF1A;&#x6253;&#x5370;&#x673A;&#x7B49;&#x8BB8;&#x591A;&#x786C;&#x4EF6;&#x8BBE;&#x5907;&#xFF0C;&#x90FD;&#x5C5E;&#x4E8E;&#x4E34;&#x754C;&#x8D44;&#x6E90;&#xFF0C;&#x8BF8;&#x8FDB;&#x7A0B;&#x95F4;&#x91C7;&#x7528;&#x4E92;&#x65A5;&#x65B9;&#x5F0F;&#xFF0C;&#x5B9E;&#x73B0;&#x5BF9;&#x8FD9;&#x79CD;&#x8D44;&#x6E90;&#x7684;&#x5171;&#x4EAB;&#x3002;</p>
<p>&#x4E34;&#x754C;&#x533A;&#x3002;&#x5BF9;&#x4E8E;&#x4E34;&#x754C;&#x8D44;&#x6E90;&#xFF0C;&#x8FDB;&#x7A0B;&#x5FC5;&#x987B;&#x91C7;&#x7528;&#x4E92;&#x65A5;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x8BBF;&#x95EE;&#x3002;&#x90A3;&#x4E48;<strong>&#x8BBF;&#x95EE;&#x4E34;&#x754C;&#x8D44;&#x6E90;&#x7684;&#x90A3;&#x6BB5;&#x4EE3;&#x7801;</strong>&#x79F0;&#x4E3A;&#x4E34;&#x754C;&#x533A;&#x3002;</p>
<p>&#x540C;&#x6B65;&#x673A;&#x5236;&#x9075;&#x5FAA;&#x7684;&#x89C4;&#x5219;</p>
<ol type="1">
<li>&#x7A7A;&#x95F2;&#x8BA9;&#x8FDB;&#x3002;&#x65E0;&#x8FDB;&#x7A0B;&#x5904;&#x4E8E;&#x4E34;&#x754C;&#x533A;&#x65F6;&#xFF0C;&#x8868;&#x660E;&#x4E34;&#x754C;&#x8D44;&#x6E90;&#x5904;&#x4E8E;&#x7A7A;&#x95F2;&#x72B6;&#x6001;&#xFF0C;&#x5141;&#x8BB8;&#x8BF7;&#x6C42;&#x7684;&#x8FDB;&#x7A0B;&#x8FDB;&#x5165;&#x81EA;&#x5DF1;&#x7684;&#x4E34;&#x754C;&#x533A;</li>
<li>&#x5FD9;&#x5219;&#x7B49;&#x5F85;&#x3002;&#x5F53;&#x5DF2;&#x6709;&#x8FDB;&#x7A0B;&#x8FDB;&#x5165;&#x4E34;&#x754C;&#x533A;&#x65F6;&#xFF0C;&#x8868;&#x660E;&#x4E34;&#x754C;&#x8D44;&#x6E90;&#x6B63;&#x5728;&#x88AB;&#x8BBF;&#x95EE;&#xFF0C;&#x5176;&#x4ED6;&#x8BD5;&#x56FE;&#x8FDB;&#x5165;&#x4E34;&#x754C;&#x533A;&#x7684;&#x8FDB;&#x7A0B;&#x5FC5;&#x987B;&#x7B49;&#x5F85;</li>
<li>&#x6709;&#x9650;&#x7B49;&#x5F85;&#x3002;&#x5BF9;&#x8981;&#x6C42;&#x8BBF;&#x95EE;&#x4E34;&#x754C;&#x8D44;&#x6E90;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x5E94;&#x4FDD;&#x8BC1;&#x5728;&#x6709;&#x9650;&#x65F6;&#x95F4;&#x5185;&#x8FDB;&#x5165;&#x4E34;&#x754C;&#x533A;&#xFF0C;&#x4EE5;&#x514D;&#x8FDB;&#x5165;&#x201C;&#x6B7B;&#x7B49;&#x201D;&#x72B6;&#x6001;</li>
<li>&#x8BA9;&#x6743;&#x7B49;&#x5F85;&#x3002;&#x5F53;&#x8FDB;&#x7A0B;&#x4E0D;&#x80FD;&#x8FDB;&#x5165;&#x4E34;&#x754C;&#x533A;&#x65F6;&#xFF0C;&#x5E94;&#x7ACB;&#x5373;&#x91CA;&#x653E;&#x5904;&#x7406;&#x673A;&#xFF0C;&#x4EE5;&#x514D;&#x8FDB;&#x5165;&#x201C;&#x5FD9;&#x7B49;&#x201D;&#x72B6;&#x6001;</li>
</ol>
<h4 id="&#x4FE1;&#x53F7;&#x91CF;&#x673A;&#x5236;">3.2 &#x4FE1;&#x53F7;&#x91CF;&#x673A;&#x5236;</h4>
<blockquote>
<p>&#x4FE1;&#x53F7;&#x91CF;&#x673A;&#x5236;&#x662F;&#x4E00;&#x79CD;&#x8FDB;&#x7A0B;&#x540C;&#x6B65;&#x7684;&#x5DE5;&#x5177;&#x3002;</p>
</blockquote>
<ol type="1">
<li>&#x6574;&#x578B;&#x4FE1;&#x53F7;&#x91CF;</li>
</ol>
<p>&#x6700;&#x521D;&#x7684;&#x6574;&#x578B;&#x4FE1;&#x53F7;&#x91CF;&#x88AB;&#x5B9A;&#x4E49;&#x4E3A;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x8868;&#x793A;&#x8D44;&#x6E90;&#x6570;&#x76EE;&#x7684;&#x6574;&#x578B;&#x91CF;S&#xFF0C;&#x9664;&#x4E86;&#x521D;&#x59CB;&#x5316;&#x4E4B;&#x5916;&#xFF0C;&#x4EC5;&#x80FD;&#x901A;&#x8FC7;&#x4E24;&#x4E2A;&#x6807;&#x51C6;&#x7684;&#x539F;&#x5B50;&#x64CD;&#x4F5C;wait(S)&#x548C;signal(S)&#x6765;&#x8BBF;&#x95EE;&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x88AB;&#x5206;&#x522B;&#x79F0;&#x4E3A;P&#xFF0C;V&#x64CD;&#x4F5C;&#x3002;P&#xFF0C;V&#x64CD;&#x4F5C;&#x53EF;&#x4EE5;&#x63CF;&#x8FF0;&#x4E3A;&#xFF1A;</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br></pre></td><td class="code"><pre><span class="line">wait(S):</span><br><span class="line">	while S &lt;= 0 do no-op</span><br><span class="line">	S:=S-1</span><br><span class="line">signal(S):</span><br><span class="line">	S:=S+1</span><br></pre></td></tr></table></figure>
<p>wait(S)&#x548C;signal(S)&#x662F;&#x4E24;&#x4E2A;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#xFF0C;&#x6267;&#x884C;&#x65F6;&#x4E0D;&#x53EF;&#x4E2D;&#x65AD;&#x3002;</p>
<p>wait(S)&#x64CD;&#x4F5C;&#xFF1A;&#x5F53;&#x8D44;&#x6E90;&#x6570;&#x76EE;S&#x5927;&#x4E8E;0&#x65F6;&#xFF0C;&#x5373;&#x8FDB;&#x7A0B;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x8BE5;&#x8D44;&#x6E90;&#xFF0C;&#x968F;&#x540E;&#x5C06;&#x8BE5;&#x8D44;&#x6E90;&#x6570;&#x76EE;-1&#xFF1B;&#x5F53;&#x8D44;&#x6E90;&#x6570;&#x76EE;S&#x5C0F;&#x4E8E;&#x7B49;&#x4E8E;0&#x65F6;&#xFF0C;&#x8868;&#x793A;&#x6CA1;&#x6709;&#x7A7A;&#x95F2;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x8FDB;&#x7A0B;&#x7B49;&#x5F85;&#x4E0D;&#x505A;&#x4EFB;&#x4F55;&#x64CD;&#x4F5C;&#xFF0C;&#x76F4;&#x81F3;&#x6709;&#x8D44;&#x6E90;&#x88AB;&#x91CA;&#x653E;</p>
<p>signal(S)&#x64CD;&#x4F5C;&#xFF1A;&#x6BCF;&#x6B21;&#x91CA;&#x653E;&#x8D44;&#x6E90;&#x540E;&#xFF0C;&#x8D44;&#x6E90;&#x6570;&#x76EE;+1</p>
<ol start="2" type="1">
<li>&#x8BB0;&#x5F55;&#x578B;&#x4FE1;&#x53F7;&#x91CF;</li>
</ol>
<p>&#x6574;&#x578B;&#x4FE1;&#x53F7;&#x91CF;&#x673A;&#x5236;&#x4E2D;&#x7684;wait&#x64CD;&#x4F5C;&#xFF0C;&#x53EA;&#x8981;&#x4FE1;&#x53F7;&#x91CF;S&lt;=0&#xFF0C;&#x5C31;&#x4F1A;&#x4E0D;&#x65AD;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8BE5;&#x673A;&#x5236;&#x672A;&#x9075;&#x5FAA;&#x201C;&#x8BA9;&#x6743;&#x7B49;&#x5F85;&#x201D;&#x51C6;&#x5219;&#xFF0C;&#x800C;&#x4F7F;&#x8FDB;&#x7A0B;&#x5904;&#x4E8E;&#x201C;&#x5FD9;&#x7B49;&#x201D;&#x7684;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x8BB0;&#x5F55;&#x578B;&#x4FE1;&#x53F7;&#x91CF;&#x673A;&#x5236;&#x662F;&#x4E00;&#x79CD;&#x4E0D;&#x5B58;&#x5728;&#x201C;&#x5FD9;&#x7B49;&#x201D;&#x73B0;&#x8C61;&#x7684;&#x8FDB;&#x7A0B;&#x540C;&#x6B65;&#x673A;&#x5236;&#xFF0C;&#x91C7;&#x53D6;&#x201C;&#x8BA9;&#x6743;&#x7B49;&#x5F85;&#x201D;&#xFF0C;&#x4F46;&#x662F;&#x6B64;&#x65F6;&#x4F1A;&#x51FA;&#x73B0;&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#x8BBF;&#x95EE;&#x540C;&#x4E00;&#x4E34;&#x754C;&#x8D44;&#x6E90;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x56E0;&#x6B64;&#x8FD8;&#x5E94;&#x8BE5;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x94FE;&#x8868;&#x6307;&#x9488;L&#xFF0C;&#x7528;&#x4E8E;&#x94FE;&#x63A5;&#x4E0A;&#x8FF0;&#x7684;&#x6240;&#x6709;&#x7B49;&#x5F85;&#x8FDB;&#x7A0B;&#x3002;</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br></pre></td><td class="code"><pre><span class="line">procedure wait(S)</span><br><span class="line">	var S: semaphore</span><br><span class="line">	begin</span><br><span class="line">		S.value:=S.value-1</span><br><span class="line">		if S.value&lt;0 then block(S, L)</span><br><span class="line">	end</span><br><span class="line">procedure signal(S)</span><br><span class="line">	var S: semaphore</span><br><span class="line">	begin</span><br><span class="line">		S.val:=S.value+1</span><br><span class="line">		if S.value&lt;=0 then wakeup(S, L)</span><br><span class="line">	end</span><br></pre></td></tr></table></figure>
<p>&#x8BB0;&#x5F55;&#x578B;&#x4FE1;&#x53F7;&#x91CF;&#x673A;&#x5236;&#x4E2D;&#xFF0C;S.value&#x7684;&#x521D;&#x503C;&#x4EE3;&#x8868;<strong>&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x67D0;&#x7C7B;&#x8D44;&#x6E90;&#x7684;&#x6570;&#x76EE;</strong>&#xFF0C;&#x53C8;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x8D44;&#x6E90;&#x4FE1;&#x53F7;&#x91CF;&#x201D;&#x3002;</p>
<p>wait&#x64CD;&#x4F5C;&#xFF1A;&#x610F;&#x5473;&#x7740;&#x8FDB;&#x7A0B;&#x8BF7;&#x6C42;&#x4E00;&#x4E2A;&#x5355;&#x4F4D;&#x7684;&#x8BE5;&#x7C7B;&#x8D44;&#x6E90;&#xFF0C;&#x4F7F;&#x7CFB;&#x7EDF;&#x4E2D;&#x53EF;&#x4F9B;&#x5206;&#x914D;&#x7684;&#x8BE5;&#x7C7B;&#x8D44;&#x6E90;&#x6570;&#x76EE;-1&#xFF1B;&#x5F53;S.value&lt;0&#x65F6;&#xFF0C;&#x8868;&#x793A;&#x7CFB;&#x7EDF;&#x5185;&#x65E0;&#x53EF;&#x5206;&#x914D;&#x7684;&#x8BE5;&#x7C7B;&#x8D44;&#x6E90;&#xFF0C;&#x56E0;&#x6B64;&#x8FDB;&#x7A0B;&#x8C03;&#x7528;block&#x539F;&#x8BED;&#x8FDB;&#x884C;&#x81EA;&#x6211;&#x963B;&#x585E;&#xFF0C;&#x653E;&#x5F03;&#x5904;&#x7406;&#x673A;&#xFF0C;&#x5E76;&#x63D2;&#x5165;&#x5230;&#x94FE;&#x8868;L&#x4E2D;&#x3002;&#x6B64;&#x65F6;<strong>S.value&#x7684;&#x7EDD;&#x5BF9;&#x503C;&#x8868;&#x793A;&#x7CFB;&#x7EDF;&#x5185;&#x5DF2;&#x963B;&#x585E;&#x8FDB;&#x7A0B;&#x7684;&#x6570;&#x76EE;</strong>&#x3002;</p>
<p>signal&#x64CD;&#x4F5C;&#xFF1A;&#x8868;&#x793A;&#x8FDB;&#x7A0B;&#x91CA;&#x653E;&#x4E86;&#x4E00;&#x4E2A;&#x8BE5;&#x7C7B;&#x8D44;&#x6E90;&#xFF0C;&#x6B64;&#x65F6;&#x7CFB;&#x7EDF;&#x5185;&#x53EF;&#x4F9B;&#x5206;&#x914D;&#x7684;&#x4FE1;&#x53F7;&#x91CF;S.value+1&#x3002;&#x82E5;S.value&lt;=0&#x65F6;&#xFF0C;&#x8868;&#x793A;&#x7CFB;&#x7EDF;&#x5185;&#x4ECD;&#x6709;&#x8FDB;&#x7A0B;&#x88AB;&#x963B;&#x585E;&#xFF0C;&#x6545;&#x5E94;&#x8BE5;&#x8C03;&#x7528;wakeup&#x539F;&#x8BED;&#x5524;&#x9192;&#x94FE;&#x8868;L&#x4E2D;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x7B49;&#x5F85;&#x8FDB;&#x7A0B;&#x3002;</p>
<ol start="3" type="1">
<li>And&#x578B;&#x4FE1;&#x53F7;&#x91CF;</li>
</ol>
<p>&#x6574;&#x578B;&#x4FE1;&#x53F7;&#x91CF;&#x673A;&#x5236;&#x4E0E;&#x8BB0;&#x5F55;&#x578B;&#x4FE1;&#x53F7;&#x91CF;&#x673A;&#x5236;&#x662F;&#x9488;&#x5BF9;&#x5404;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x53EA;&#x5171;&#x4EAB;&#x4E00;&#x4E2A;&#x4E34;&#x754C;&#x8D44;&#x6E90;&#x800C;&#x8A00;&#x7684;&#x3002;&#x90A3;&#x4E48;&#x5F53;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x9700;&#x8981;&#x83B7;&#x5F97;&#x4E24;&#x4E2A;&#x6216;&#x66F4;&#x591A;&#x7684;&#x5171;&#x4EAB;&#x8D44;&#x6E90;&#x540E;&#x65B9;&#x80FD;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x7528;&#x5230;And&#x578B;&#x4FE1;&#x53F7;&#x91CF;&#x673A;&#x5236;&#x3002;</p>
<p>And&#x578B;&#x4FE1;&#x53F7;&#x91CF;&#x601D;&#x60F3;&#xFF1A; &#x5C06;&#x8FDB;&#x7A0B;&#x5728;&#x5728;&#x8FD0;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x9700;&#x8981;&#x7684;&#x8D44;&#x6E90;&#xFF0C;<strong>&#x4E00;&#x6B21;&#x6027;&#x5168;&#x90E8;</strong>&#x5206;&#x914D;&#x7ED9;&#x8BE5;&#x8FDB;&#x7A0B;&#xFF0C;&#x5F85;&#x8FDB;&#x7A0B;&#x4F7F;&#x7528;&#x5B8C;&#x4E4B;&#x540E;&#x5728;&#x5168;&#x90E8;&#x91CA;&#x653E;&#x3002;&#x53EA;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x8D44;&#x6E90;&#x672A;&#x88AB;&#x5206;&#x914D;&#x7ED9;&#x8BE5;&#x8FDB;&#x7A0B;&#xFF0C;&#x5176;&#x4ED6;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x4E3A;&#x4E4B;&#x5206;&#x914D;&#x7684;&#x8D44;&#x6E90;&#x90FD;&#x4E0D;&#x5206;&#x914D;&#x7ED9;&#x5B83;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x82E5;&#x5E72;&#x4E2A;&#x8D44;&#x6E90;&#x7684;&#x5206;&#x914D;&#x91C7;&#x7528;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#x7684;&#x65B9;&#x5F0F;&#xFF1A;&#x8981;&#x4E48;&#x5168;&#x90E8;&#x5206;&#x914D;&#xFF0C;&#x8981;&#x4E48;&#x4E00;&#x4E2A;&#x4E5F;&#x4E0D;&#x5206;&#x914D;&#xFF0C;&#x8FD9;&#x6837;&#x80FD;&#x591F;&#x907F;&#x514D;&#x6B7B;&#x9501;&#x3002;</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br></pre></td><td class="code"><pre><span class="line">Swait(S1, S2, ..., Sn)</span><br><span class="line">	if Si&gt;=1 and ... Sn&gt;=1 then</span><br><span class="line">		for i:=1 to n do</span><br><span class="line">				Si:=Si-1</span><br><span class="line">		endfor</span><br><span class="line">	else</span><br><span class="line">	place the process in the waiting queue associated with the first Si found with Si&lt;1&#xFF0C;and set the program count of this process to the beginning of Swait operation</span><br><span class="line">	endif</span><br><span class="line">Signal(S1, S2, ..., Sn)</span><br><span class="line">	for i:=1 to n do</span><br><span class="line">			Si:=Si+1</span><br><span class="line">	Remove all the process waiting in the queue associated with Si into the ready queue.</span><br><span class="line">	endfor</span><br></pre></td></tr></table></figure>
<p>wait&#x64CD;&#x4F5C;&#xFF1A;&#x786E;&#x4FDD;&#x8FDB;&#x7A0B;&#x6240;&#x9700;&#x7684;&#x6240;&#x6709;&#x8D44;&#x6E90;&#x90FD;&#x5B58;&#x5728;&#xFF0C;&#x90A3;&#x4E48;&#x5C06;&#x6240;&#x9700;&#x7684;&#x6240;&#x6709;&#x8D44;&#x6E90;&#x90FD;&#x5206;&#x914D;&#x7ED9;&#x8BE5;&#x8FDB;&#x7A0B;&#x3002;&#x5373;&#xFF1A;&#x6240;&#x9700;&#x7684;&#x6240;&#x6709;&#x8D44;&#x6E90;&#x6570;&#x76EE;-1&#xFF1B;&#x5426;&#x5219;&#xFF0C;&#x4E0D;&#x7ED9;&#x4E88;&#x5206;&#x914D;&#x4EFB;&#x4F55;&#x8D44;&#x6E90;</p>
<p>signal&#x64CD;&#x4F5C;&#xFF1A;&#x91CA;&#x653E;&#x5206;&#x914D;&#x7ED9;&#x8BE5;&#x8FDB;&#x7A0B;&#x7684;&#x6240;&#x6709;&#x8D44;&#x6E90;&#xFF0C;&#x5373;&#xFF1A;&#x5DF2;&#x5206;&#x914D;&#x8D44;&#x6E90;&#x7684;&#x6570;&#x76EE;+1</p>
<ol start="4" type="1">
<li>&#x4FE1;&#x53F7;&#x91CF;&#x96C6;</li>
</ol>
<p>&#x5728;&#x8BB0;&#x5F55;&#x578B;&#x4FE1;&#x53F7;&#x91CF;&#x4E2D;&#xFF0C;wait&#x64CD;&#x4F5C;&#x548C;signal&#x64CD;&#x4F5C;&#x4EC5;&#x80FD;&#x5BF9;&#x4FE1;&#x53F7;&#x91CF;&#x5B9E;&#x65BD;+1&#x6216;&#x8005;-1&#xFF0C;&#x5F53;&#x4E00;&#x6B21;&#x9700;&#x8981;N&#x4E2A;&#x4E34;&#x754C;&#x8D44;&#x6E90;&#x65F6;&#xFF0C;&#x4FBF;&#x8981;&#x8FDB;&#x884C;N&#x6B64;wait&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x663E;&#x7136;&#x5F88;&#x4F4E;&#x6548;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5F53;&#x8D44;&#x6E90;&#x6570;&#x76EE;&#x4F4E;&#x4E8E;&#x67D0;&#x4E00;&#x4E0B;&#x9650;&#x65F6;&#xFF0C;&#x4FBF;&#x4E0D;&#x4E88;&#x5206;&#x914D;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x6BCF;&#x6B21;&#x5206;&#x914D;&#x4E4B;&#x524D;&#x90FD;&#x9700;&#x8981;<strong>&#x6D4B;&#x8BD5;&#x8BE5;&#x8D44;&#x6E90;&#x7684;&#x6570;&#x76EE;</strong>&#xFF0C;&#x770B;&#x5176;&#x662F;&#x5426;&#x5927;&#x4E8E;&#x4E0B;&#x9650;&#x503C;&#x3002;</p>
<p>&#x57FA;&#x4E8E;&#x4EE5;&#x4E0A;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x53EF;&#x4EE5;&#x5BF9;&#x201C;And&#x4FE1;&#x53F7;&#x91CF;&#x673A;&#x5236;&#x201D;&#x8FDB;&#x884C;&#x6269;&#x5C55;&#x3002;</p>
<p>&#x4E0B;&#x8FF0;S&#x4E3A;&#x4FE1;&#x53F7;&#x91CF;&#xFF0C;t&#x4E3A;&#x4E0B;&#x9650;&#x503C;&#xFF0C;d&#x4E3A;&#x9700;&#x6C42;&#x503C;</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br></pre></td><td class="code"><pre><span class="line">Swait(S1, S2, ..., Sn, tn, dn)</span><br><span class="line">	if Si&gt;=t1 and ... Sn&gt;=tn then</span><br><span class="line">		for i:=1 to n do</span><br><span class="line">				Si:=Si-di</span><br><span class="line">		endfor</span><br><span class="line">	else</span><br><span class="line">	place the process in the waiting queue associated with the first Si found with Si&lt;1&#xFF0C;and set the program count of this process to the beginning of Swait operation</span><br><span class="line">	endif</span><br><span class="line">Signal(S1, S2, ..., Sn, dn)</span><br><span class="line">	for i:=1 to n do</span><br><span class="line">		Si:=Si+di</span><br><span class="line">	Remove all the process waiting in the queue associated with Si into the ready queue.</span><br><span class="line">	endfor</span><br></pre></td></tr></table></figure>
<p>wait&#x64CD;&#x4F5C;&#xFF1A;&#x6BCF;&#x6B21;&#x5206;&#x914D;&#x81F3;&#x4E4B;&#x524D;&#xFF0C;&#x5148;&#x53BB;&#x5224;&#x65AD;&#x6240;&#x9700;&#x6BCF;&#x7C7B;&#x8D44;&#x6E90;&#x7684;&#x4FE1;&#x53F7;&#x91CF;&#x662F;&#x5426;&#x5927;&#x4E8E;&#x7B49;&#x4E8E;&#x5176;&#x4E0B;&#x9650;&#x503C;&#xFF0C;&#x82E5;&#x6EE1;&#x8DB3;&#x6761;&#x4EF6;&#xFF0C;&#x5219;&#x8FDB;&#x884C;&#x5206;&#x914D;&#xFF0C;&#x6BCF;&#x6B21;&#x5206;&#x914D;&#x5176;&#x6240;&#x9700;&#x7684;&#x8D44;&#x6E90;&#x6570;&#x76EE;di&#xFF1B;&#x5426;&#x5219;&#xFF0C;&#x4E0D;&#x4E88;&#x5206;&#x914D;</p>
<p>signal&#x64CD;&#x4F5C;&#xFF1A;&#x6BCF;&#x6B21;&#x91CA;&#x653E;&#x5DF2;&#x5206;&#x914D;&#x7684;&#x8D44;&#x6E90;&#x6570;&#x76EE;di</p>
<p>&#x7279;&#x6B8A;&#x60C5;&#x51B5;</p>
<ol type="1">
<li>SWait(S, d, d)&#x3002;&#x6B64;&#x65F6;&#x4FE1;&#x53F7;&#x91CF;&#x96C6;&#x4E2D;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x4FE1;&#x53F7;&#x91CF;&#xFF0C;&#x5141;&#x8BB8;&#x5B83;&#x6BCF;&#x6B21;&#x7533;&#x8BF7;d&#x4E2A;&#x8D44;&#x6E90;&#xFF0C;&#x5F53;&#x73B0;&#x6709;&#x8D44;&#x6E90;&#x6570;&#x76EE;&#x5C0F;&#x4E8E;d&#x65F6;&#xFF0C;&#x4E0D;&#x4E88;&#x5206;&#x914D;</li>
<li>SWait(S, 1, 1)&#x3002;&#x6B64;&#x65F6;&#x4FE1;&#x53F7;&#x91CF;&#x96C6;&#x5DF2;&#x53D8;&#x4E3A;&#x4E00;&#x822C;&#x7684;&#x8BB0;&#x5F55;&#x578B;&#x4FE1;&#x53F7;&#x91CF;&#x6216;&#x4E92;&#x65A5;&#x4FE1;&#x53F7;&#x91CF;</li>
<li>SWait(S, 1, 0)&#x3002;&#x5F53;S&gt;=1&#x65F6;&#xFF0C;&#x5141;&#x8BB8;&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#x8FDB;&#x5165;&#x67D0;&#x7279;&#x5B9A;&#x533A;&#xFF1B;&#x5F53;S&#x53D8;&#x4E3A;0&#x540E;&#xFF0C;&#x5C06;&#x963B;&#x6B62;&#x4EFB;&#x4F55;&#x8FDB;&#x7A0B;&#x8FDB;&#x5165;&#x7279;&#x5B9A;&#x533A;</li>
</ol>
<h4 id="&#x7BA1;&#x7A0B;&#x673A;&#x5236;">3.3 &#x7BA1;&#x7A0B;&#x673A;&#x5236;</h4>
<p>&#x7BA1;&#x7A0B;&#xFF1A;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x548C;&#x80FD;&#x4E3A;&#x5E76;&#x53D1;&#x8FDB;&#x7A0B;&#x6240;&#x6267;&#x884C;&#x5728;&#x8BE5;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0A;&#x7684;&#x4E00;&#x7EC4;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x7EC4;&#x64CD;&#x4F5C;&#x80FD;&#x540C;&#x6B65;&#x8FDB;&#x7A0B;&#x548C;&#x6539;&#x53D8;&#x7BA1;&#x7A0B;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x3002;&#x7BA1;&#x7A0B;&#x7531;&#x4EE5;&#x4E0B;&#x56DB;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#xFF1A;</p>
<ol type="1">
<li>&#x7BA1;&#x7A0B;&#x7684;&#x540D;&#x79F0;</li>
<li>&#x5C40;&#x90E8;&#x4E8E;&#x7BA1;&#x7A0B;&#x5185;&#x90E8;&#x7684;&#x5171;&#x4EAB;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x8BF4;&#x660E;</li>
<li>&#x5BF9;&#x8BE5;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x7684;&#x4E00;&#x7EC4;&#x8FC7;&#x7A0B;</li>
<li>&#x5BF9;&#x5C40;&#x90E8;&#x7BA1;&#x7A0B;&#x5185;&#x90E8;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x5171;&#x4EAB;&#x6570;&#x636E;&#x8BBE;&#x7F6E;&#x521D;&#x59CB;&#x503C;&#x7684;&#x8BED;&#x53E5;</li>
</ol>
<blockquote>
<p>&#x5C40;&#x90E8;&#x4E8E;&#x7BA1;&#x7A0B;&#x5185;&#x90E8;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x4EC5;&#x80FD;&#x88AB;&#x7BA1;&#x7A0B;&#x5185;&#x7684;&#x8FC7;&#x7A0B;&#x8BBF;&#x95EE;&#xFF0C;&#x4EFB;&#x4F55;&#x7BA1;&#x7A0B;&#x5916;&#x7684;&#x90FD;&#x4E0D;&#x80FD;&#x8BBF;&#x95EE;&#x5B83;&#x3002;</p>
<p>&#x5C40;&#x90E8;&#x4E8E;&#x7BA1;&#x7A0B;&#x5185;&#x90E8;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x53EA;&#x80FD;&#x8BBF;&#x95EE;&#x7BA1;&#x7A0B;&#x5185;&#x90E8;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x7BA1;&#x7A0B;&#x76F8;&#x5F53;&#x4E8E;&#x56F4;&#x5899;&#xFF0C;&#x628A;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x548C;&#x5BF9;&#x5B83;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x7684;&#x82E5;&#x5E72;&#x8FC7;&#x7A0B;&#x56F4;&#x8D77;&#x6765;&#xFF0C;&#x6240;&#x6709;&#x8981;&#x8BBF;&#x95EE;&#x4E34;&#x754C;&#x8D44;&#x6E90;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x90FD;&#x5FC5;&#x987B;&#x901A;&#x8FC7;&#x7BA1;&#x7A0B;&#x6765;&#x8BBF;&#x95EE;&#xFF0C;&#x800C;&#x7BA1;&#x7A0B;&#x6BCF;&#x6B21;&#x53EA;&#x5141;&#x8BB8;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x8FDB;&#x5165;&#x7BA1;&#x7A0B;&#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x4E86;&#x8FDB;&#x7A0B;&#x4E92;&#x65A5;&#x3002;</p>
</blockquote>
<h3 id="&#x7ECF;&#x5178;&#x8FDB;&#x7A0B;&#x540C;&#x6B65;&#x95EE;&#x9898;">4. &#x7ECF;&#x5178;&#x8FDB;&#x7A0B;&#x540C;&#x6B65;&#x95EE;&#x9898;</h3>
<h4 id="&#x751F;&#x4EA7;&#x8005;-&#x6D88;&#x8D39;&#x8005;&#x95EE;&#x9898;">4.1 &#x751F;&#x4EA7;&#x8005;-&#x6D88;&#x8D39;&#x8005;&#x95EE;&#x9898;</h4>
<p>&#x5229;&#x7528;<strong>&#x8BB0;&#x5F55;&#x578B;&#x4FE1;&#x53F7;&#x91CF;&#x673A;&#x5236;</strong>&#x89E3;&#x51B3;</p>
<p>&#x5047;&#x5B9A;&#x751F;&#x4EA7;&#x8005;&#x4E0E;&#x6D88;&#x8D39;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x516C;&#x7528;&#x7F13;&#x51B2;&#x6C60;&#x4E2D;&#xFF0C;&#x5177;&#x6709;n&#x4E2A;&#x7F13;&#x51B2;&#x533A;&#xFF0C;&#x5229;&#x7528;&#x4E92;&#x65A5;&#x4FE1;&#x53F7;&#x91CF;mutex&#x5B9E;&#x73B0;&#x8BF8;&#x8FDB;&#x7A0B;&#x5BF9;&#x7F13;&#x51B2;&#x6C60;&#x7684;&#x4E92;&#x65A5;&#x4F7F;&#x7528;&#xFF0C;&#x5229;&#x7528;&#x4FE1;&#x53F7;&#x91CF;empty&#x548C;full&#x5206;&#x522B;&#x8868;&#x793A;&#x7F13;&#x51B2;&#x6C60;&#x8FD9;&#x79CD;&#x7A7A;&#x7F13;&#x51B2;&#x533A;&#x548C;&#x6EE1;&#x7F13;&#x51B2;&#x533A;&#x6570;&#x91CF;&#x3002;</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br></pre></td><td class="code"><pre><span class="line">Var mutex, empty, full: semaphore:=1, n, 0</span><br><span class="line">	buffer:array[0, ... , n-1] of item</span><br><span class="line">	in, out: integer:=0, 0</span><br><span class="line">	begin</span><br><span class="line">		parbegin</span><br><span class="line">			procedure: begin</span><br><span class="line">				repeat</span><br><span class="line">					producer an item nextp;</span><br><span class="line">					wait(empty);</span><br><span class="line">					wait(mutex);</span><br><span class="line">					buffer(in):=nextp;</span><br><span class="line">					in:=(in+1) mod n;</span><br><span class="line">					signal(mutex);</span><br><span class="line">					signal(full);</span><br><span class="line">					until false;</span><br><span class="line">				end</span><br><span class="line">			consumer: begin</span><br><span class="line">				repeat</span><br><span class="line">				wait(full);</span><br><span class="line">				wait(mutex);</span><br><span class="line">				nextc:=buffer(out);</span><br><span class="line">				out:=(out+1) mod n;</span><br><span class="line">				signal(mutex);</span><br><span class="line">				signal(empty);</span><br><span class="line">				consumer the item in nextc;</span><br><span class="line">				until false</span><br><span class="line">			end</span><br><span class="line">		parend</span><br><span class="line">	end</span><br></pre></td></tr></table></figure>
<p>&#x751F;&#x4EA7;&#x8005;&#xFF1A;&#x82E5;&#x7A7A;&#x7F13;&#x51B2;&#x533A;&#x6570;&#x91CF;&#x4E3A;0&#xFF0C;&#x5219;&#x4E0D;&#x4E88;&#x4EFB;&#x4F55;&#x64CD;&#x4F5C;&#xFF0C;&#x5426;&#x5219;&#x5C06;&#x7A7A;&#x7F13;&#x51B2;&#x533A;&#x6570;&#x91CF;-1&#xFF0C;&#x751F;&#x4EA7;&#x8005;&#x5BF9;&#x7F13;&#x51B2;&#x6C60;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;<code>wait(mutex)</code>,&#x5C06;&#x751F;&#x4EA7;&#x7684;nextp&#x653E;&#x5165;&#x7F13;&#x51B2;&#x533A;&#x5185;<code>buffer(in):=nextp</code>&#x5E76;&#x6307;&#x9488;&#x540E;&#x79FB;<code>in:=(in+1) mod n</code>&#xFF1B;&#x7ED3;&#x675F;&#x5BF9;&#x7F13;&#x51B2;&#x6C60;&#x7684;&#x4F7F;&#x7528;<code>signal(mutex)</code>&#xFF0C;&#x589E;&#x52A0;&#x7F13;&#x51B2;&#x6C60;&#x4E2D;&#x7684;&#x6EE1;&#x7F13;&#x51B2;&#x533A;&#x6570;&#x91CF;<code>signal(full)</code></p>
<p>&#x6D88;&#x8D39;&#x8005;&#x540C;&#x7406;</p>
<p>&#x5229;&#x7528;<strong>And&#x4FE1;&#x53F7;&#x91CF;&#x673A;&#x5236;</strong>&#x89E3;&#x51B3;&#x751F;&#x4EA7;&#x8005;-&#x6D88;&#x8D39;&#x8005;&#x95EE;&#x9898;</p>
<p>&#x5229;&#x7528;Swait(empty, mutex)&#x6765;&#x4EE3;&#x66FF;wait(empty)&#x548C;wait(mutex)&#xFF1B;&#x7528;Ssignal(mutex, full)&#x6765;&#x4EE3;&#x66FF;signal(mutex)&#x548C;signal(full)&#x7B49;</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br></pre></td><td class="code"><pre><span class="line">Var mutex, empty, full: semaphore:=1, n, 0</span><br><span class="line">	buffer:array[0, ... , n-1] of item</span><br><span class="line">	in, out: integer:=0, 0</span><br><span class="line">	begin</span><br><span class="line">		parbegin</span><br><span class="line">			procedure: begin</span><br><span class="line">				repeat</span><br><span class="line">					producer an item nextp;</span><br><span class="line">					Swait(empty, mutex);</span><br><span class="line">					buffer(in):=nextp;</span><br><span class="line">					in:=(in+1) mod n;</span><br><span class="line">					Ssignal(mutex, full);</span><br><span class="line">					until false;</span><br><span class="line">				end</span><br><span class="line">			consumer: begin</span><br><span class="line">				repeat</span><br><span class="line">				Swait(full, mutex);</span><br><span class="line">				nextc:=buffer(out);</span><br><span class="line">				out:=(out+1) mod n;</span><br><span class="line">				Ssignal(mutex, empty);</span><br><span class="line">				consumer the item in nextc;</span><br><span class="line">				until false</span><br><span class="line">			end</span><br><span class="line">		parend</span><br><span class="line">	end</span><br></pre></td></tr></table></figure>
<p>&#x5229;&#x7528;<strong>&#x7BA1;&#x7A0B;&#x673A;&#x5236;</strong>&#x89E3;&#x51B3;&#x751F;&#x4EA7;&#x8005;-&#x6D88;&#x8D39;&#x8005;&#x95EE;&#x9898;</p>
<p>&#x9996;&#x5148;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x7BA1;&#x7A0B;PC&#xFF0C;&#x5176;&#x5305;&#x62EC;</p>
<ol type="1">
<li>Put(item)&#xFF1A;&#x751F;&#x4EA7;&#x8005;&#x5C06;&#x4EA7;&#x54C1;&#x653E;&#x5165;&#x7F13;&#x51B2;&#x6C60;&#xFF1B;&#x5F53;&#x7F13;&#x51B2;&#x6C60;&#x4E2D;&#x4EA7;&#x54C1;&#x6570;&gt;=n&#x65F6;&#xFF0C;&#x7F13;&#x51B2;&#x6C60;&#x5DF2;&#x6EE1;&#xFF0C;&#x751F;&#x4EA7;&#x8005;&#x7B49;&#x5F85;</li>
<li>Get(item)&#xFF1A;&#x6D88;&#x8D39;&#x8005;&#x4ECE;&#x7F13;&#x51B2;&#x6C60;&#x4E2D;&#x53D6;&#x51FA;&#x4EA7;&#x54C1;&#xFF1B;&#x5F53;&#x7F13;&#x51B2;&#x6C60;&#x4E2D;&#x4EA7;&#x54C1;&#x6570;&lt;=0&#x65F6;&#xFF0C;&#x7F13;&#x51B2;&#x6C60;&#x65E0;&#x4EA7;&#x54C1;&#xFF0C;&#x6D88;&#x8D39;&#x8005;&#x7B49;&#x5F85;</li>
</ol>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line"></span><br></pre></td></tr></table></figure>
<h4 id="&#x54F2;&#x5B66;&#x5BB6;&#x8FDB;&#x9910;&#x95EE;&#x9898;">4.2 &#x54F2;&#x5B66;&#x5BB6;&#x8FDB;&#x9910;&#x95EE;&#x9898;</h4>
<p>&#x5229;&#x7528;<strong>&#x8BB0;&#x5F55;&#x578B;&#x4FE1;&#x53F7;&#x91CF;</strong>&#x89E3;&#x51B3;&#x54F2;&#x5B66;&#x5BB6;&#x8FDB;&#x9910;&#x95EE;&#x9898;</p>
<p>&#x684C;&#x5B50;&#x4E0A;&#x7684;&#x7B77;&#x5B50;&#x90FD;&#x662F;&#x4E34;&#x754C;&#x8D44;&#x6E90;&#xFF0C;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x53EA;&#x5141;&#x8BB8;&#x4E00;&#x4F4D;&#x54F2;&#x5B66;&#x5BB6;&#x4F7F;&#x7528;&#x3002;&#x5B9E;&#x73B0;&#x5BF9;&#x7B77;&#x5B50;&#x7684;&#x4E92;&#x65A5;&#x4F7F;&#x7528;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x4FE1;&#x53F7;&#x91CF;&#x8868;&#x793A;&#x4E00;&#x53EA;&#x7B77;&#x5B50;&#x3002;</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line">Var chopstick: array[0, ..., 4] of semaphore</span><br><span class="line">	repeat</span><br><span class="line">		wait(chopstick[i]);</span><br><span class="line">		wait(chopstick[(i+1) mod 5])</span><br><span class="line">		eat;</span><br><span class="line">		signal(chopstick[i]);</span><br><span class="line">		signal(chopstick[(i+1) mod 5])</span><br><span class="line">	unti false;</span><br></pre></td></tr></table></figure>
<p>&#x4E0A;&#x8FF0;&#x8868;&#x793A;&#x54F2;&#x5B66;&#x5BB6;&#x6BCF;&#x6B21;&#x5148;&#x53BB;&#x62FF;&#x4ED6;&#x4EEC;&#x5DE6;&#x8FB9;&#x7684;&#x7B77;&#x5B50;&#xFF0C;&#x6210;&#x529F;&#x4E4B;&#x540E;&#x518D;&#x53BB;&#x62FF;&#x53F3;&#x8FB9;&#x7684;&#x7B77;&#x5B50;&#x3002;</p>
<p>&#x8FD9;&#x65F6;&#x4F1A;&#x9047;&#x5230;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E94;&#x4E2A;&#x54F2;&#x5B66;&#x5BB6;&#x540C;&#x65F6;&#x62FF;&#x8D77;&#x4E86;&#x4ED6;&#x4EEC;&#x5404;&#x81EA;&#x7684;&#x5DE6;&#x8FB9;&#x7684;&#x7B77;&#x5B50;&#xFF0C;&#x6B64;&#x65F6;&#x6240;&#x6709;&#x7684;&#x54F2;&#x5B66;&#x5BB6;&#x90FD;&#x5904;&#x4E8E;&#x7B49;&#x5F85;&#x72B6;&#x6001;&#xFF0C;&#x9020;&#x6210;&#x6B7B;&#x9501;&#x3002;&#x4EE5;&#x4E0B;&#x51E0;&#x79CD;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x6B7B;&#x9501;&#x95EE;&#x9898;&#xFF1A;</p>
<ol type="1">
<li>&#x6700;&#x591A;&#x5141;&#x8BB8;4&#x4F4D;&#x54F2;&#x5B66;&#x5BB6;&#x540C;&#x65F6;&#x53BB;&#x62FF;&#x7B77;&#x5B50;</li>
<li>&#x4EC5;&#x5F53;&#x54F2;&#x5B66;&#x5BB6;&#x5DE6;&#x53F3;&#x4E24;&#x4E2A;&#x7B77;&#x5B50;&#x5747;&#x53EF;&#x7528;&#x65F6;&#xFF0C;&#x624D;&#x5141;&#x8BB8;&#x4ED6;&#x62FF;&#x8D77;&#x7B77;&#x5B50;</li>
<li>&#x89C4;&#x5B9A;&#x5947;&#x6570;&#x53F7;&#x54F2;&#x5B66;&#x5BB6;&#x5148;&#x62FF;&#x5176;&#x5DE6;&#x8FB9;&#x7B77;&#x5B50;&#xFF0C;&#x5076;&#x6570;&#x53F7;&#x54F2;&#x5B66;&#x5BB6;&#x5219;&#x76F8;&#x53CD;</li>
</ol>
<p>&#x5229;&#x7528;<strong>And&#x4FE1;&#x53F7;&#x91CF;&#x673A;&#x5236;</strong>&#x89E3;&#x51B3;&#x54F2;&#x5B66;&#x5BB6;&#x8FDB;&#x9910;&#x95EE;&#x9898;</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br></pre></td><td class="code"><pre><span class="line">Var chopsiick array of semaphore:=(1,1,1,1,1)</span><br><span class="line">	repeat</span><br><span class="line">		Swait(chopstick[i], chopstick[(i+1) mod 5])</span><br><span class="line">		eat;</span><br><span class="line">		Ssignal(chopstick[i], chopstick[(i+1) mod 5])</span><br><span class="line">	unti false;</span><br></pre></td></tr></table></figure>
<h4 id="&#x8BFB;&#x8005;-&#x5199;&#x8005;&#x95EE;&#x9898;">4.3 &#x8BFB;&#x8005;-&#x5199;&#x8005;&#x95EE;&#x9898;</h4>
<blockquote>
<p>&#x5141;&#x8BB8;&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#x8BFB;&#x4E00;&#x4E2A;&#x5171;&#x4EAB;&#x5BF9;&#x8C61;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x5141;&#x8BB8;&#x4E00;&#x4E2A;&#x5199;&#x8FDB;&#x7A0B;&#x548C;&#x5176;&#x4ED6;&#x8BFB;&#x8FDB;&#x7A0B;&#x540C;&#x65F6;&#x8BBF;&#x95EE;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x8BFB;&#x8005;-&#x5199;&#x8005;&#x95EE;&#x9898;&#x5373;&#x4E3A;&#xFF1A;&#x4FDD;&#x8BC1;Write&#x8FDB;&#x7A0B;&#x4E0E;&#x5176;&#x4ED6;&#x8FDB;&#x7A0B;&#x4E92;&#x65A5;&#x8BBF;&#x95EE;&#x5171;&#x4EAB;&#x5BF9;&#x8C61;&#x7684;&#x540C;&#x6B65;&#x95EE;&#x9898;</p>
</blockquote>
<p>&#x5229;&#x7528;<strong>&#x8BB0;&#x5F55;&#x578B;&#x4FE1;&#x53F7;&#x91CF;</strong>&#x89E3;&#x51B3;&#x8BFB;&#x8005;-&#x5199;&#x8005;&#x95EE;&#x9898;</p>
<p>&#x4E3A;&#x5B9E;&#x73B0;Writer&#x8FDB;&#x7A0B;&#x4E0E;Reader&#x8FDB;&#x7A0B;&#x5728;&#x8BFB;&#x6216;&#x5199;&#x7684;&#x4E92;&#x65A5;&#x8BBE;&#x7F6E;&#x4E86;&#x4E00;&#x4E2A;&#x4E92;&#x65A5;&#x4FE1;&#x53F7;&#x91CF;Wmutex&#xFF1B;&#x8BBE;&#x7F6E;&#x53D8;&#x91CF;Readercount&#x8868;&#x793A;&#x6B63;&#x5728;&#x8BFB;&#x7684;&#x8FDB;&#x7A0B;&#x6570;&#x76EE;&#x3002;&#x53EA;&#x8981;&#x6709;&#x8FDB;&#x7A0B;&#x5728;&#x8BFB;&#x5171;&#x4EAB;&#x5BF9;&#x8C61;&#xFF0C;&#x4FBF;&#x4E0D;&#x5141;&#x8BB8;Writer&#x8FDB;&#x7A0B;&#x53BB;&#x5199;&#x3002;&#x4EC5;&#x5F53;Readercount&#x503C;&#x4E3A;0&#x65F6;&#xFF0C;&#x8868;&#x793A;&#x8FD9;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x8BFB;&#x7684;&#x8FDB;&#x7A0B;&#x8981;&#x548C;&#x5199;&#x8FDB;&#x7A0B;&#x4E92;&#x65A5;&#xFF0C;&#x624D;&#x9700;&#x8981;&#x53BB;wai t(wmutex)&#xFF1B;&#x8BFB;&#x5B8C;&#x4E4B;&#x540E;&#x82E5;Readercount&gt;0&#xFF0C;&#x8868;&#x793A;&#x8FD8;&#x6709;&#x8FDB;&#x7A0B;&#x4ECD;&#x5728;&#x8BFB;&#xFF0C;&#x6545;&#x4EC5;&#x5F53;Readercount=0&#x65F6;&#xFF0C;&#x624D;&#x9700;&#x8981;signal(wmutex)</p>
<h3 id="&#x8FDB;&#x7A0B;&#x901A;&#x4FE1;">5. &#x8FDB;&#x7A0B;&#x901A;&#x4FE1;</h3>
<blockquote>
<p>&#x8FDB;&#x7A0B;&#x901A;&#x4FE1;&#xFF1A;&#x6307;&#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x7684;&#x4FE1;&#x606F;&#x4EA4;&#x6362;&#x3002;</p>
<p>&#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x7684;&#x4E92;&#x65A5;&#x548C;&#x540C;&#x6B65;&#xFF0C;&#x7531;&#x4E8E;&#x5176;&#x4EA4;&#x6362;&#x7684;&#x4FE1;&#x606F;&#x91CF;&#x5C11;&#x800C;&#x88AB;&#x5F52;&#x4E3A;&#x4F4E;&#x7EA7;&#x901A;&#x4FE1;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x5185;&#x5BB9;&#x5C5E;&#x4E8E;<strong>&#x9AD8;&#x7EA7;&#x8FDB;&#x7A0B;&#x901A;&#x4FE1;</strong>---&#x6307;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5229;&#x7528;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x4E00;&#x7EC4;&#x653B;&#x5FC3;&#x547D;&#x4EE4;&#x9AD8;&#x6548;&#x5730;&#x4F20;&#x8F93;&#x5927;&#x91CF;&#x6570;&#x636E;&#x7684;&#x901A;&#x4FE1;&#x65B9;&#x5F0F;&#x3002;</p>
</blockquote>
<h4 id="&#x8FDB;&#x7A0B;&#x901A;&#x4FE1;&#x7684;&#x7C7B;&#x578B;">5.1 &#x8FDB;&#x7A0B;&#x901A;&#x4FE1;&#x7684;&#x7C7B;&#x578B;</h4>
<p>&#x9AD8;&#x7EA7;&#x901A;&#x4FE1;&#x673A;&#x5236;&#x5206;&#x4E3A;&#x4E09;&#x5927;&#x7C7B;&#xFF1A;&#x5171;&#x4EAB;&#x5B58;&#x50A8;&#x5668;&#x7CFB;&#x7EDF;&#xFF0C;&#x6D88;&#x606F;&#x4F20;&#x9012;&#x7CFB;&#x7EDF;&#xFF0C;&#x7BA1;&#x9053;&#x901A;&#x4FE1;&#x7CFB;&#x7EDF;</p>
<ol type="1">
<li>&#x5171;&#x4EAB;&#x5B58;&#x50A8;&#x5668;&#x7CFB;&#x7EDF;&#xFF1A;&#x76F8;&#x4E92;&#x901A;&#x4FE1;&#x7684;&#x8FDB;&#x7A0B;&#x5171;&#x4EAB;&#x67D0;&#x4E9B;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6216;&#x5171;&#x4EAB;&#x5B58;&#x50A8;&#x533A;&#xFF0C;&#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B;&#x7A7A;&#x95F4;&#x6765;&#x901A;&#x4FE1;
<ol type="1">
<li>&#x57FA;&#x4E8E;&#x5171;&#x4EAB;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x901A;&#x4FE1;&#x65B9;&#x5F0F;&#x3002;&#x6B64;&#x901A;&#x4FE1;&#x65B9;&#x5F0F;&#x8981;&#x6C42;&#x8BF8;&#x591A;&#x8FDB;&#x7A0B;&#x516C;&#x7528;&#x67D0;&#x4E9B;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6765;&#x5B9E;&#x73B0;&#x4FE1;&#x606F;&#x4EA4;&#x6362;</li>
<li>&#x57FA;&#x4E8E;&#x5171;&#x4EAB;&#x5B58;&#x50A8;&#x533A;&#x7684;&#x901A;&#x4FE1;&#x65B9;&#x5F0F;&#x3002;&#x5728;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x5212;&#x51FA;&#x4E00;&#x5757;&#x5171;&#x4EAB;&#x5B58;&#x50A8;&#x533A;&#xFF0C;&#x8BF8;&#x8FDB;&#x7A0B;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5BF9;&#x5171;&#x4EAB;&#x5B58;&#x50A8;&#x533A;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x8BFB;&#x6216;&#x5199;&#x6765;&#x8FDB;&#x884C;&#x901A;&#x4FE1;</li>
</ol></li>
<li>&#x6D88;&#x606F;&#x4F20;&#x9012;&#x7CFB;&#x7EDF;
<ol type="1">
<li>&#x8FDB;&#x7A0B;&#x95F4;&#x7684;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x662F;&#x4EE5;&#x683C;&#x5F0F;&#x5316;&#x7684;&#x6D88;&#x606F;&#x4E3A;&#x5355;&#x4F4D;&#x7684;</li>
<li>&#x5206;&#x4E3A;&#x76F4;&#x63A5;&#x901A;&#x4FE1;&#x65B9;&#x5F0F;&#x548C;&#x95F4;&#x63A5;&#x901A;&#x4FE1;&#x65B9;&#x5F0F;</li>
</ol></li>
<li>&#x7BA1;&#x9053;&#x901A;&#x4FE1;
<ol type="1">
<li>&#x201C;&#x7BA1;&#x9053;&#x201D;&#xFF1A;&#x7528;&#x4E8E;&#x8FDE;&#x63A5;&#x4E00;&#x4E2A;&#x8BFB;&#x8FDB;&#x7A0B;&#x548C;&#x4E00;&#x4E2A;&#x5199;&#x8FDB;&#x7A0B;&#x4EE5;&#x5B9E;&#x73B0;&#x4ED6;&#x4EEC;&#x4E4B;&#x95F4;&#x901A;&#x4FE1;&#x7684;&#x4E00;&#x4E2A;&#x5171;&#x4EAB;&#x6587;&#x4EF6;pipe</li>
<li>&#x5F53;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x3001;&#x6B63;&#x5728;&#x5BF9;pipe&#x8FDB;&#x884C;&#x6267;&#x884C;&#x8BFB;/&#x5199;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x5FC5;&#x987B;&#x7B49;&#x5F85;</li>
<li>&#x5F53;pipe&#x6EE1;&#x65F6;&#xFF0C;&#x5199;&#x8FDB;&#x7A0B;&#x7761;&#x7720;&#x7B49;&#x5F85;&#xFF1B;&#x5F53;pipe&#x7A7A;&#x65F6;&#xFF0C;&#x8BFB;&#x8FDB;&#x7A0B;&#x7761;&#x7720;&#x7B49;&#x5F85;</li>
<li>&#x53EA;&#x6709;&#x8BFB;/&#x5199;&#x8FDB;&#x7A0B;&#x786E;&#x5B9A;&#x4E86;&#x5BF9;&#x65B9;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x624D;&#x80FD;&#x8FDB;&#x884C;&#x901A;&#x4FE1;</li>
</ol></li>
</ol>
<h4 id="&#x6D88;&#x606F;&#x4F20;&#x9012;&#x901A;&#x4FE1;">5.2 &#x6D88;&#x606F;&#x4F20;&#x9012;&#x901A;&#x4FE1;</h4>
<ol type="1">
<li>&#x76F4;&#x63A5;&#x901A;&#x4FE1;&#x65B9;&#x5F0F;
<ol type="1">
<li>&#x53D1;&#x9001;&#x8FDB;&#x7A0B;&#x5229;&#x7528;OS&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x547D;&#x4EE4;&#xFF0C;&#x76F4;&#x63A5;&#x5C06;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x5230;&#x76EE;&#x6807;&#x8FDB;&#x7A0B;&#x3002;</li>
<li>Send(Receiver, message); Receive(Sender, message)</li>
</ol></li>
<li>&#x95F4;&#x63A5;&#x901A;&#x4FE1;&#x65B9;&#x5F0F;
<ol type="1">
<li>&#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x4F5C;&#x4E3A;&#x5171;&#x4EAB;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x5B9E;&#x4F53;&#x3002;&#x8BE5;&#x5B9E;&#x4F53;&#x7528;&#x6765;&#x6682;&#x5B58;&#x4FE1;&#x606F;&#xFF0C;&#x8BE5;&#x5B9E;&#x4F53;&#x901A;&#x5E38;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x4FE1;&#x7BB1;&#x201D;&#x3002;&#x5229;&#x7528;&#x4FE1;&#x7BB1;&#xFF0C;&#x53EF;&#x5B9E;&#x73B0;&#x5B9E;&#x65F6;&#x901A;&#x4FE1;&#xFF0C;&#x53C8;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x975E;&#x5B9E;&#x65F6;&#x901A;&#x4FE1;&#x3002;</li>
<li>&#x53D1;&#x9001;&#x65B9;&#x9700;&#x8981;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x7ED9;&#x4FE1;&#x606F;&#xFF0C;&#x63A5;&#x6536;&#x65B9;&#x4ECE;&#x4FE1;&#x7BB1;&#x5185;&#x83B7;&#x53D6;&#x6D88;&#x606F;</li>
</ol></li>
</ol>
<h3 id="&#x7EBF;&#x7A0B;">6. &#x7EBF;&#x7A0B;</h3>
<blockquote>
<p>&#x8FDB;&#x7A0B;&#x4F5C;&#x4E3A;&#x62E5;&#x6709;&#x8D44;&#x6E90;&#x548C;&#x72EC;&#x7ACB;&#x8FD0;&#x884C;&#x7684;&#x57FA;&#x672C;&#x5355;&#x4F4D;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8FDB;&#x7A0B;&#x8FDB;&#x884C;&#x5207;&#x6362;&#x65F6;&#x7531;&#x4E8E;&#x9700;&#x8981;&#x4FDD;&#x7559;&#x5F53;&#x524D;&#x8FDB;&#x7A0B;&#x7684;CPU&#x73AF;&#x5883;&#x548C;&#x8BBE;&#x7F6E;&#x65B0;&#x9009;&#x4E2D;&#x8FDB;&#x7A0B;&#x7684;CPU&#x73AF;&#x5883;&#xFF0C;&#x56E0;&#x800C;&#x4F1A;&#x8BDD;&#x8D39;&#x5927;&#x91CF;&#x7684;&#x5904;&#x7406;&#x673A;&#x65F6;&#x95F4;&#x3002;&#x8FDB;&#x7A0B;&#x4F5C;&#x4E3A;&#x8D44;&#x6E90;&#x7684;&#x62E5;&#x6709;&#x8005;&#xFF0C;&#x5728;&#x521B;&#x5EFA;&#xFF0C;&#x64A4;&#x9500;&#xFF0C;&#x5207;&#x6362;&#x65F6;&#x5FC5;&#x5C06;&#x6709;&#x7740;&#x5927;&#x91CF;&#x7684;&#x65F6;&#x7A7A;&#x5F00;&#x9500;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7A0B;&#x5E8F;&#x80FD;&#x591F;&#x66F4;&#x597D;&#x5730;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x5E76;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x51CF;&#x5C11;&#x65F6;&#x7A7A;&#x5F00;&#x9500;&#xFF0C;&#x5F15;&#x5165;&#x4E86;&#x7EBF;&#x7A0B;&#x3002;&#x4F7F;&#x8FDB;&#x7A0B;&#x4F5C;&#x4E3A;&#x62E5;&#x6709;&#x8D44;&#x6E90;&#x7684;&#x57FA;&#x672C;&#x5355;&#x4F4D;&#xFF0C;&#x800C;&#x7EBF;&#x7A0B;&#x4F5C;&#x4E3A;&#x8C03;&#x5EA6;&#x548C;&#x5206;&#x6D3E;&#x7684;&#x57FA;&#x672C;&#x5355;&#x4F4D;&#x3002;</p>
</blockquote>
<h4 id="&#x7EBF;&#x7A0B;&#x5C5E;&#x6027;">6.1 &#x7EBF;&#x7A0B;&#x5C5E;&#x6027;</h4>
<ol type="1">
<li>&#x8F7B;&#x578B;&#x5B9E;&#x4F53;&#x3002;&#x7EBF;&#x7A0B;&#x57FA;&#x672C;&#x4E0D;&#x62E5;&#x6709;&#x8D44;&#x6E90;</li>
<li>&#x72EC;&#x7ACB;&#x8C03;&#x5EA6;&#x548C;&#x5206;&#x6D3E;&#x7684;&#x57FA;&#x672C;&#x5355;&#x4F4D;&#x3002;&#x7EBF;&#x7A0B;&#x7684;&#x5207;&#x6362;&#x975E;&#x5E38;&#x8FC5;&#x901F;&#x4E14;&#x5F00;&#x9500;&#x5C0F;</li>
<li>&#x53EF;&#x5E76;&#x53D1;&#x6267;&#x884C;</li>
<li>&#x5171;&#x4EAB;&#x8FDB;&#x7A0B;&#x8D44;&#x6E90;</li>
</ol>
<h4 id="&#x7EBF;&#x7A0B;&#x95F4;&#x7684;&#x540C;&#x6B65;&#x548C;&#x901A;&#x4FE1;">6.2 &#x7EBF;&#x7A0B;&#x95F4;&#x7684;&#x540C;&#x6B65;&#x548C;&#x901A;&#x4FE1;</h4>
<ol type="1">
<li>&#x4E92;&#x65A5;&#x9501;</li>
</ol>
<p>&#x4E92;&#x65A5;&#x9501;&#x662F;&#x4E00;&#x79CD;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x7528;&#x4E8E;&#x5B9E;&#x73B0;&#x7EBF;&#x7A0B;&#x95F4;&#x5BF9;&#x8D44;&#x6E90;&#x4E92;&#x65A5;&#x8BBF;&#x7684;&#x673A;&#x5236;&#x3002;&#x9002;&#x7528;&#x4E8E;&#x9AD8;&#x9891;&#x5EA6;&#x4F7F;&#x7528;&#x7684;&#x5173;&#x952E;&#x5171;&#x4EAB;&#x6570;&#x636E;&#x548C;&#x7A0B;&#x5E8F;&#x6BB5;&#x3002;&#x6709;&#x5F00;&#x9501;unlock&#x548C;&#x5173;&#x9501;lock&#x4E24;&#x79CD;&#x72B6;&#x6001;&#x3002;</p>
<ol start="2" type="1">
<li>&#x6761;&#x4EF6;&#x53D8;&#x91CF;</li>
</ol>
<p>&#x53EA;&#x4F7F;&#x7528;&#x4E92;&#x65A5;&#x9501;&#x7684;&#x60C5;&#x51B5;&#x6781;&#x5176;&#x5BB9;&#x6613;&#x9020;&#x6210;&#x201C;&#x6B7B;&#x9501;&#x201D;&#x73B0;&#x8C61;&#x3002;</p>
<ol start="3" type="1">
<li>&#x4FE1;&#x53F7;&#x91CF;&#x673A;&#x5236;
<ol type="1">
<li>&#x79C1;&#x6709;&#x4FE1;&#x53F7;&#x91CF;&#x3002;&#x5F53;&#x7EBF;&#x7A0B;&#x9700;&#x8981;&#x5229;&#x7528;&#x4FE1;&#x53F7;&#x91CF;&#x6765;&#x5B9E;&#x73B0;<strong>&#x540C;&#x4E00;&#x8FDB;&#x7A0B;&#x4E2D;</strong>&#x5404;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x7684;&#x540C;&#x6B65;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E00;&#x79C1;&#x6709;&#x4FE1;&#x53F7;&#x91CF;&#xFF0C;&#x5176;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5B58;&#x653E;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x4E2D;&#x3002;&#x79C1;&#x6709;&#x4FE1;&#x53F7;&#x91CF;&#x5C5E;&#x4E8E;&#x7279;&#x5B9A;&#x7684;&#x8FDB;&#x7A0B;&#x6240;&#x6709;&#xFF0C;OS&#x4E0D;&#x77E5;&#x9053;&#x4FE1;&#x53F7;&#x91CF;&#x7684;&#x5B58;&#x5728;&#xFF1B;&#x5F53;&#x79C1;&#x6709;&#x4FE1;&#x53F7;&#x91CF;&#x7684;&#x5360;&#x7528;&#x8005;&#x6B63;&#x5E38;&#x7ED3;&#x675F;&#x6216;&#x5F02;&#x5E38;&#x7ED3;&#x675F;&#x65F6;&#xFF0C;OS&#x65E0;&#x6CD5;&#x4F7F;&#x5B83;&#x6062;&#x590D;&#x4E3A;0&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x5C06;&#x5176;&#x4F20;&#x9001;&#x7ED9;&#x4E0B;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x8FDB;&#x7A0B;&#x3002;</li>
<li>&#x5171;&#x6709;&#x4FE1;&#x53F7;&#x91CF;&#x3002;&#x516C;&#x6709;&#x4FE1;&#x53F7;&#x91CF;&#x662F;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;<strong>&#x4E0D;&#x540C;&#x8FDB;&#x7A0B;&#x95F4;&#x6216;&#x4E0D;&#x540C;&#x8FDB;&#x7A0B;&#x4E2D;&#x5404;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x7684;&#x540C;&#x6B65;&#x800C;&#x8BBE;&#x7F6E;&#x7684;</strong>&#x3002;&#x5176;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x653E;&#x5728;&#x53D7;&#x4FDD;&#x62A4;&#x7684;&#x7CFB;&#x7EDF;&#x5B58;&#x50A8;&#x533A;&#x5185;&#xFF0C;&#x7531;OS&#x4E3A;&#x5176;&#x5206;&#x914D;&#x7A7A;&#x95F4;&#x5E76;&#x8FDB;&#x884C;&#x7BA1;&#x7406;&#xFF0C;&#x6545;&#x79F0;&#x201C;&#x7CFB;&#x7EDF;&#x4FE1;&#x53F7;&#x91CF;&#x201D;&#x3002;&#x5728;&#x5176;&#x5360;&#x6709;&#x8005;&#x7ED3;&#x675F;&#x65F6;&#x4E3A;&#x91CA;&#x653E;&#x8BE5;&#x516C;&#x6709;&#x4FE1;&#x53F7;&#x91CF;&#xFF0C;OS&#x4F1A;&#x81EA;&#x52A8;&#x56DE;&#x6536;&#x8BE5;&#x4FE1;&#x53F7;&#x91CF;&#x7A7A;&#x95F4;&#xFF0C;&#x5E76;&#x901A;&#x77E5;&#x4E0B;&#x4E00;&#x8FDB;&#x7A0B;</li>
</ol></li>
</ol>

    
  </div>
  <footer>
    
      
      
    
    <div class="clearfix"></div>
  </footer>
</article>

</div>
  </div>
  <footer id="footer"><div class="copyright">
  
  &copy; 2021 <a href="/">John Doe</a>
  
</div>
<div class="theme-copyright">
  Theme by <a href="https://github.com/orderedlist" target="_blank">orderedlist</a>
   | 
  Redesign by <a href="http://heroicyang.com/" target="_blank">Heroic Yang</a>
</div>
<div class="clearfix"></div></footer>
  <script src="//ajax.googleapis.com/ajax/libs/jquery/1.8/jquery.min.js"></script>
<script src="/js/scale.fix.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>




<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
  (function($){
    $('.fancybox').fancybox();
  })(jQuery);
</script>

</body>
</html>